/* REXX */                                                                      
ARG  YYMMM PATH APPL ENVR CCID                                                  
YY = SUBSTR(YYMMM,1,2)                                                          
MMM = SUBSTR(YYMMM,3,3)                                                         
SELECT                                                                          
    WHEN MMM = 'JAN' THEN MM = '01'                                             
    WHEN MMM = 'FEB' THEN MM = '02'                                             
    WHEN MMM = 'MAR' THEN MM = '03'                                             
    WHEN MMM = 'APR' THEN MM = '04'                                             
    WHEN MMM = 'MAY' THEN MM = '05'                                             
    WHEN MMM = 'JUN' THEN MM = '06'                                             
    WHEN MMM = 'JUL' THEN MM = '07'                                             
    WHEN MMM = 'AUG' THEN MM = '08'                                             
    WHEN MMM = 'SEP' THEN MM = '09'                                             
    WHEN MMM = 'OCT' THEN MM = '10'                                             
    WHEN MMM = 'NOV' THEN MM = '11'                                             
    WHEN MMM = 'DEC' THEN MM = '12'                                             
END                                                                             
QUEUE " SET TO ENVIRONMENT PRODEMER SYSTEM "APPL||PATH" SUBSYSTEM "APPL         
QUEUE "         STAGE  F  ."                                                    
QUEUE " SET OPTIONS CCID     "CCID                                              
QUEUE "     REPLACE"                                                            
QUEUE "     OVERRIDE SIGNOUT"                                                   
QUEUE "     UPDATE"                                                             
QUEUE "     COMMENTS 'ADDED TO INT FOR "YY||MM"' ."                             
"EXECIO * DISKR ELEMENTS (FINIS STEM ELEMREC."                                  
DO I = 1 TO ELEMREC.0                                                           
  IF     SUBSTR(ELEMREC.I,1,1)  = '*'                                           
  THEN ITERATE                                                                  
  ELSE                                                                          
    DO                                                                          
      SAY 'ADDING ' ELEMREC.I                                                   
      MEMBER = WORD(ELEMREC.I,1)                                                
      TYPE   = WORD(ELEMREC.I,2)                                                
      PROC   = WORD(ELEMREC.I,3)                                                
      SYMBLS = WORD(ELEMREC.I,4)                                                
      QUEUE " ADD ELEMENT "MEMBER" TO TYPE "TYPE                                
      SELECT                                                                    
         WHEN TYPE = 'TABLESEQ' THEN                                            
           DO                                                                   
              QUEUE "      FROM  FILE  "MEMBER                                  
           END                                                                  
         WHEN TYPE = 'BINDCNTL' THEN                                            
           DO                                                                   
              QUEUE "      FROM  FILE BINDNDVR"                                 
           END                                                                  
         OTHERWISE                                                              
           DO                                                                   
              QUEUE "      FROM  FILE "TYPE                                     
           END                                                                  
      END                                                                       
      IF PROC <> '' THEN                                                        
          QUEUE "   OPTIONS PROCESSOR GROUP = '"PROC"'  "                       
      IF SYMBLS <> '' THEN                                                      
          QUEUE "   "SYMBLS"  "                                                 
      QUEUE " ."                                                                
    END                                                                         
END                                                                             
QUEUE "*"                                                                       
QUEUE "  ."                                                                     
"ALLOC FI(CARDDSN) DA('BMGVZ0CN.UNIT.SCL(A"USERID()")') SHR"                    
"EXECIO * DISKW CARDDSN (FINIS"                                                 
"FREE FI(CARDDSN)"                                                              
"REPRO INFILE(ELEMENTS) OUTFILE(ELEMENTX)"                                      
