/*REXX BMGS313: REXX TO CREATE DB2 STORED PROCEDURE */                          
ARG TESTID DB2SYS OWNER COLLID MEMBER CURSORS                                   
CALL GETPROCL MEMBER                                                            
PROCNAME = RESULT                                                               
DB2CNTL = TESTID".BMGS313."MEMBER                                               
PDSMEM = "BMGVZ0CN.UNIT.SPCNTL("MEMBER")"                                       
/****************************************************/                          
"FREE FI(DB2CNTL)"                                                              
"DELETE '"DB2CNTL"'"                                                            
"ALLOC FI(DB2CNTL) DA('"DB2CNTL"') NEW"                                         
QUEUE "  SET CURRENT SQLID='#DB2BMG';"                                          
QUEUE "  COMMIT;"                                                               
QUEUE "  CREATE PROCEDURE "OWNER"."PROCNAME" ( "                                
QUEUE "         IN  APP_USER_ID   CHAR(20),"                                    
QUEUE "         IN  DEBUG_LEVEL   CHAR(1),"                                     
QUEUE "         OUT RETURN_CODE   INTEGER,"                                     
QUEUE "         OUT REASON_CODE   CHAR(8),"                                     
QUEUE "         OUT ERROR_TEXT    VARCHAR(2000),"                               
QUEUE "         OUT SP_SQLCODE    INTEGER,"                                     
QUEUE "         OUT SP_SQLTOKENS  CHAR(70),"                                    
QUEUE "         OUT SP_SQLSTATE   CHAR(5),"                                     
QUEUE "         IN  MAN           CHAR(13),"                                    
QUEUE "         IN  MAN_BILL_DATE CHAR(10),"                                    
QUEUE "         IN  ORIG_SYSTEM   CHAR(2),"                                     
QUEUE "         IN  BAN           CHAR(13),"                                    
QUEUE "         IN  BILL_DATE     CHAR(10),"                                    
QUEUE "         IN  ABAN          CHAR(13),"                                    
QUEUE "         IN  DTL_TYPE      CHAR(1),"                                     
QUEUE "         INOUT TOKEN_ST    CHAR(26),"                                    
QUEUE "         IN  PAGE_OFFSET   INTEGER,"                                     
QUEUE "         IN  PAGE_SIZE     SMALLINT,"                                    
QUEUE "         OUT TOTAL_ROWS    INTEGER"                                      
QUEUE "  ) "                                                                    
QUEUE "    LANGUAGE COBOL "                                                     
QUEUE "    EXTERNAL NAME "MEMBER" "                                             
QUEUE "    PARAMETER STYLE GENERAL "                                            
QUEUE "    MODIFIES SQL DATA "                                                  
QUEUE "    NOT DETERMINISTIC "                                                  
QUEUE "    COLLID "COLLID" "                                                    
QUEUE "    WLM ENVIRONMENT BMG"DB2SYS                                           
QUEUE "    STAY RESIDENT NO  "                                                  
QUEUE "    RUN OPTIONS 'STACK(,,BELOW),ALL31(OFF)' "                            
QUEUE "    RESULT SETS "CURSORS";"                                              
QUEUE "  COMMIT;"                                                               
"EXECIO * DISKW DB2CNTL (FINIS"                                                 
"FREE FI(PDSMEM)"                                                               
"ALLOC FI(PDSMEM) DA('"PDSMEM"') SHR"                                           
"REPRO INFILE(DB2CNTL) OUTFILE(PDSMEM)"                                         
"FREE FI(PDSMEM)"                                                               
"FREE FI(DB2CNTL)"                                                              
