/*REXX UNSIGN: TO CREATE SCL TO REASSIGN AN ENDEVOR ELEMENT*/                   
ARG TYPE MEMBER USERID SCLDSN                                                   
                                                                                
QUEUE "SIGNIN ELEMENT '"MEMBER"'"                                               
QUEUE "  FROM ENVIRONMENT 'TEST' SYSTEM 'BMG0' SUBSYSTEM 'BMG'"                 
QUEUE "    TYPE '"TYPE"' STAGE I"                                               
QUEUE "  OPTIONS SIGNOUT TO "USERID" OVERRIDE SIGNOUT"                          
QUEUE " ."                                                                      
QUEUE "SIGNIN ELEMENT '"MEMBER"'"                                               
QUEUE "  FROM ENVIRONMENT 'TEST' SYSTEM 'BMG1' SUBSYSTEM 'BMG'"                 
QUEUE "    TYPE '"TYPE"' STAGE I"                                               
QUEUE "  OPTIONS SIGNOUT TO "USERID" OVERRIDE SIGNOUT"                          
QUEUE " ."                                                                      
QUEUE "SIGNIN ELEMENT '"MEMBER"'"                                               
QUEUE "  FROM ENVIRONMENT 'TEST' SYSTEM 'BMG0' SUBSYSTEM 'BMG'"                 
QUEUE "    TYPE '"TYPE"' STAGE A"                                               
QUEUE "  OPTIONS SIGNOUT TO "USERID" OVERRIDE SIGNOUT"                          
QUEUE " ."                                                                      
QUEUE "SIGNIN ELEMENT '"MEMBER"'"                                               
QUEUE "  FROM ENVIRONMENT 'TEST' SYSTEM 'BMG1' SUBSYSTEM 'BMG'"                 
QUEUE "    TYPE '"TYPE"' STAGE A"                                               
QUEUE "  OPTIONS SIGNOUT TO "USERID" OVERRIDE SIGNOUT"                          
QUEUE " ."                                                                      
QUEUE "SIGNIN ELEMENT '"MEMBER"'"                                               
QUEUE "  FROM ENVIRONMENT 'PREREL' SYSTEM 'BMG' SUBSYSTEM 'BMG'"                
QUEUE "    TYPE '"TYPE"' STAGE S"                                               
QUEUE "  OPTIONS SIGNOUT TO "USERID" OVERRIDE SIGNOUT"                          
QUEUE " ."                                                                      
QUEUE "SIGNIN ELEMENT '"MEMBER"'"                                               
QUEUE "  FROM ENVIRONMENT 'RELEASE' SYSTEM 'BMG' SUBSYSTEM 'BMG'"               
QUEUE "    TYPE '"TYPE"' STAGE P"                                               
QUEUE "  OPTIONS SIGNOUT TO "USERID" OVERRIDE SIGNOUT"                          
QUEUE " ."                                                                      
"DELETE '"SCLDSN"'"                                                             
"ALLOC FI(CARDDSN) DA('"SCLDSN"')  NEW CATALOG DATACLAS(PSFB80)"                
"EXECIO * DISKW CARDDSN (FINIS"                                                 
"FREE FI(CARDDSN)"                                                              
