000100******************************************************************00000100
000200*THIS PROGRAM CREATES THE FILELIST AFTER COMPARING THE PROFILE   *00000200
000300*THAT IS IN THE BM_CONFIG_MAN_T & BM_CONFIG_PROC_T TABLES.       *00000300
000400*CHANGED DATE                   COMMENTS                         *00000400
000500* 12-04-2004        A NEW PARA B300-ADD-RECREATE-CONFIG IS ADDED *00000500
000600*                   TO ADD ALL THE RECREATE CONFIG'S IN THE      *00000600
000700*                   FILELIST FILE.                               *00000700
000800******************************************************************00000800
000900 IDENTIFICATION DIVISION.                                         00000900
001000******************************************************************00001000
001100 PROGRAM-ID. BMGBM3C.                                             00001100
001200******************************************************************00001200
001300 ENVIRONMENT DIVISION.                                            00001300
001400******************************************************************00001400
001500 CONFIGURATION SECTION.                                           00001500
001600 SOURCE-COMPUTER.  IBM-370.                                       00001600
001700 OBJECT-COMPUTER.  IBM-370.                                       00001700
001800******************************************************************00001800
001900 INPUT-OUTPUT SECTION.                                            00001900
002000******************************************************************00002000
002100 FILE-CONTROL.                                                    00002100
002200        SELECT FILE-LISTA    ASSIGN TO FILELSTA.                  00002200
002300        SELECT FILE-LISTB    ASSIGN TO FILELSTB.                  00002300
002400        SELECT FILE-LISTC    ASSIGN TO FILELSTC.                  00002400
002500        SELECT FILE-LISTD    ASSIGN TO FILELSTD.                  00002500
002600        SELECT FILE-LISTE    ASSIGN TO FILELSTE.                  00002600
002700        SELECT FILE-LISTV    ASSIGN TO FILELSTV.                  00002700
002800        SELECT FILE-LISTW    ASSIGN TO FILELSTW.                  00002800
002900        SELECT FILE-LISTX    ASSIGN TO FILELSTX.                  00002900
003000        SELECT FILE-LISTY    ASSIGN TO FILELSTY.                  00003000
003100        SELECT FILE-LISTZ    ASSIGN TO FILELSTZ.                  00003100
003200******************************************************************00003200
003300 DATA DIVISION.                                                   00003300
003400******************************************************************00003400
003500 FILE SECTION.                                                    00003500
003600******************************************************************00003600
003700 FD  FILE-LISTA                                                   00003700
003800     BLOCK CONTAINS 0 RECORDS                                     00003800
003900     LABEL RECORDS ARE STANDARD                                   00003900
004000     RECORDING MODE IS F.                                         00004000
004100 01  FD-FILELISTA-RECORD   PIC X(146).                            00004100
004200******************************************************************00004200
004300 FD  FILE-LISTB                                                   00004300
004400     BLOCK CONTAINS 0 RECORDS                                     00004400
004500     LABEL RECORDS ARE STANDARD                                   00004500
004600     RECORDING MODE IS F.                                         00004600
004700 01  FD-FILELISTB-RECORD   PIC X(146).                            00004700
004800 FD  FILE-LISTC                                                   00004800
004900     BLOCK CONTAINS 0 RECORDS                                     00004900
005000     LABEL RECORDS ARE STANDARD                                   00005000
005100     RECORDING MODE IS F.                                         00005100
005200 01  FD-FILELISTC-RECORD   PIC X(146).                            00005200
005300 FD  FILE-LISTD                                                   00005300
005400     BLOCK CONTAINS 0 RECORDS                                     00005400
005500     LABEL RECORDS ARE STANDARD                                   00005500
005600     RECORDING MODE IS F.                                         00005600
005700 01  FD-FILELISTD-RECORD   PIC X(146).                            00005700
005800 FD  FILE-LISTE                                                   00005800
005900     BLOCK CONTAINS 0 RECORDS                                     00005900
006000     LABEL RECORDS ARE STANDARD                                   00006000
006100     RECORDING MODE IS F.                                         00006100
006200 01  FD-FILELISTE-RECORD   PIC X(146).                            00006200
006300 FD  FILE-LISTV                                                   00006300
006400     BLOCK CONTAINS 0 RECORDS                                     00006400
006500     LABEL RECORDS ARE STANDARD                                   00006500
006600     RECORDING MODE IS F.                                         00006600
006700 01  FD-FILELISTV-RECORD   PIC X(146).                            00006700
006800 FD  FILE-LISTW                                                   00006800
006900     BLOCK CONTAINS 0 RECORDS                                     00006900
007000     LABEL RECORDS ARE STANDARD                                   00007000
007100     RECORDING MODE IS F.                                         00007100
007200 01  FD-FILELISTW-RECORD   PIC X(146).                            00007200
007300 FD  FILE-LISTX                                                   00007300
007400     BLOCK CONTAINS 0 RECORDS                                     00007400
007500     LABEL RECORDS ARE STANDARD                                   00007500
007600     RECORDING MODE IS F.                                         00007600
007700 01  FD-FILELISTX-RECORD   PIC X(146).                            00007700
007800 FD  FILE-LISTY                                                   00007800
007900     BLOCK CONTAINS 0 RECORDS                                     00007900
008000     LABEL RECORDS ARE STANDARD                                   00008000
008100     RECORDING MODE IS F.                                         00008100
008200 01  FD-FILELISTY-RECORD   PIC X(146).                            00008200
008300 FD  FILE-LISTZ                                                   00008300
008400     BLOCK CONTAINS 0 RECORDS                                     00008400
008500     LABEL RECORDS ARE STANDARD                                   00008500
008600     RECORDING MODE IS F.                                         00008600
008700 01  FD-FILELISTZ-RECORD   PIC X(146).                            00008700
008800******************************************************************00008800
008900 WORKING-STORAGE SECTION.                                         00008900
009000******************************************************************00009000
009100 COPY PARSLNKC.                                                   00009100
009200 COPY THREADLK.                                                   00009200
009300 COPY LKSTRPIO.                                                   00009300
009400 COPY FILENMLK.                                                   00009400
009500     EXEC SQL                                                     00009500
009600          INCLUDE SQLCA                                           00009600
009700     END-EXEC.                                                    00009700
009800     EXEC SQL                                                     00009800
009900          INCLUDE BMCONMAN                                        00009900
010000     END-EXEC.                                                    00010000
010100     EXEC SQL                                                     00010100
010200          INCLUDE BMCONFGT                                        00010200
010300     END-EXEC.                                                    00010300
010400     EXEC SQL                                                     00010400
010500          INCLUDE BMCONPRC                                        00010500
010600     END-EXEC.                                                    00010600
010700     EXEC SQL                                                     00010700
010800          INCLUDE BMCONREC                                        00010800
010900     END-EXEC.                                                    00010900
011000     EXEC SQL                                                     00011000
011100          INCLUDE ACCSUMXT                                        00011100
011200     END-EXEC.                                                    00011200
011300     EXEC SQL                                                     00011300
011400          INCLUDE DISTACCT                                        00011400
011500     END-EXEC.                                                    00011500
011600     EXEC SQL                                                     00011600
011700          INCLUDE MASTACCT                                        00011700
011800     END-EXEC.                                                    00011800
011900     EXEC SQL                                                     00011900
012000          INCLUDE PARMXXXT                                        00012000
012100     END-EXEC.                                                    00012100
012200 01  SAV-MAN                         PIC X(13).                   00012200
012300 01  WK-MAN                          PIC X(13).                   00012300
012400 01  WK-BAN                          PIC X(13).                   00012400
012500 01  WK-OSID                         PIC X(2).                    00012500
012600 01  WK-CONFIG                       PIC X(8).                    00012600
012700     EXEC SQL                                                     00012700
012800          DECLARE MAN_CUR CURSOR WITH HOLD FOR                    00012800
012900          SELECT A.CUSTOMER_ID,                                   00012900
013000                 A.CONFIG_ID,                                     00013000
013100                 A.MAN,                                           00013100
013200                 A.EFFECTIVE_DT                                   00013200
013300            FROM BM_CONFIG_MAN_T A                                00013300
013400           WHERE A.EFFECTIVE_DT IN (SELECT MAX(EFFECTIVE_DT)      00013400
013500                 FROM BM_CONFIG_MAN_T B                           00013500
013600              WHERE A.CUSTOMER_ID    = B.CUSTOMER_ID AND          00013600
013700                       A.CONFIG_ID   = B.CONFIG_ID)               00013700
013800          AND   A.VALID_FLAG = 'Y'                                00013800
013900          ORDER BY 1,2,3,4 ASC                                    00013900
014000     END-EXEC.                                                    00014000
014100     EXEC SQL                                                     00014100
014200          DECLARE PRC_CUR CURSOR WITH HOLD FOR                    00014200
014300          SELECT A.CUSTOMER_ID,                                   00014300
014400                 A.CONFIG_ID,                                     00014400
014500                 A.MAN,                                           00014500
014600                 A.MAN_BILL_DATE,                                 00014600
014700                 A.ORIG_SYSTEM_ID,                                00014700
014800                 A.VZ450_DSNAME,                                  00014800
014900                 A.VAM_LOAD_DATE,                                 00014900
015000                 A.LOB_IND                                        00015000
015100            FROM BM_CONFIG_PROC_T A                               00015100
015200            WHERE ACCT_SENT_DT = '9999-12-31-00.00.00.000000'     00015200
015300            AND   VALID_FLAG = 'Y'                                00015300
015400            AND   GW_LOCATION <> 'E'                              00015400
015500            AND   CYCLE_DATE = '      '                           00015500
015600            ORDER BY 1,2,4,3 ASC                                  00015600
015700     END-EXEC.                                                    00015700
015800     EXEC SQL                                                     00015800
015900          DECLARE RECREATE_CUR CURSOR WITH HOLD FOR               00015900
016000            SELECT CUSTOMER_ID,CONFIG_ID,MAN,                     00016000
016100                   MAN_BILL_DATE,VZ450_DSNAME,RECREATE_COUNT,     00016100
016200                   ORIG_SYSTEM_ID                                 00016200
016300                   FROM BM_CONFIG_RECR_T                          00016300
016400             WHERE RECREATE_STAT_FLAG = 'R'                       00016400
016500             ORDER BY 1,2,4                                       00016500
016600     END-EXEC.                                                    00016600
016700     EXEC SQL                                                     00016700
016800          DECLARE  NATL_CUR CURSOR FOR                            00016800
016900          SELECT  A.CUSTOMER_ID,A.CONFIG_ID FROM                  00016900
017000                   BM_CONFIG_T A                                  00017000
017100           WHERE A.EFFECTIVE_DT = (SELECT MAX(B.EFFECTIVE_DT)     00017100
017200                            FROM BM_CONFIG_T B                    00017200
017300                          WHERE B.CUSTOMER_ID = A.CUSTOMER_ID     00017300
017400                            AND B.CONFIG_ID   = A.CONFIG_ID)      00017400
017500             AND A.VALID_FLAG = 'Y'                               00017500
017600             AND A.NATL_IND   = 'Y'                               00017600
017700     END-EXEC.                                                    00017700
017800     EXEC SQL                                                     00017800
017900          DECLARE BAN_CUR CURSOR FOR                              00017900
018000          SELECT BAN                                              00018000
018100                ,ORIG_SYSTEM_ID                                   00018100
018200            FROM DISTR_ACCTS_T                                    00018200
018300           WHERE SERVICE_TYPE = 'BM_CONFIG'                       00018300
018400             AND MAN = :WK-MAN                                    00018400
018500             AND CONFIG_ID = :WK-CONFIG                           00018500
018600             AND END_DATE = '9999-12-31'                          00018600
018700             AND BAN > ''                                         00018700
018800          ORDER BY 1       ASC                                    00018800
018900     END-EXEC.                                                    00018900
019000 COPY ALLOPARM.                                                   00019000
019100 01  WORK-DSNAME              PIC X(44) VALUE SPACES.             00019100
019200 01  DETERMINE-FILE           PIC X(1).                           00019200
019300 01  RECR-MOVE-IND            PIC X(1).                           00019300
019400 01  SPLIT-RECR               PIC X(1).                           00019400
019500 01  DETERMINE-FILE-TYPE      PIC X(1) VALUE 'N'.                 00019500
019600 01  DISPLAY-SQLCODE          PIC ZZZ,ZZ9-.                       00019600
019700 01  DISPLAY-SQLSTATE         PIC ZZZ,ZZ9-.                       00019700
019800 01  ERROR-MESSAGE.                                               00019800
019900     02 ERROR-LEN   PIC S9(4)  COMP VALUE +960.                   00019900
020000     02 ERROR-TEXT  PIC X(80) OCCURS 12 TIMES                     00020000
020100                              INDEXED BY ERROR-INDEX.             00020100
020200 77  ERROR-TEXT-LEN      PIC S9(8)  COMP VALUE +80.               00020200
020300 77  DSNTIAR-PGM         PIC X(8) VALUE 'DSNTIAR'.                00020300
020400                                                                  00020400
020500 01  STRIPIO-ERROR-CODE         PIC 9(4) VALUE ZEROES.            00020500
020600 01  FILE01-DSNAME             PIC X(44).                         00020600
020700 01  FILE01-PGM                PIC X(8) VALUE 'FILE01'.           00020700
020800 01  FILE01-ENTRY              PIC X(8).                          00020800
020900 01  FILE01-EOF-SW             PIC X(1).                          00020900
021000 01  FILE01-RECORD.                                               00021000
021100     05 FILE01-LRECL           PIC S9(4) COMP.                    00021100
021200     05 FILE01-SYS-USE         PIC S9(4) COMP.                    00021200
021300     05 FILE01-LOG-REC         PIC X(33000).                      00021300
021400 01  FILE01-JFCB               PIC X(176).                        00021400
021500 01  FILE01-ERROR-CODE         PIC X(176).                        00021500
021600 01  FILE02-DSNAME             PIC X(44).                         00021600
021700 01  FILE02-PGM                PIC X(8) VALUE 'FILE02'.           00021700
021800 01  FILE02-ENTRY              PIC X(8).                          00021800
021900 01  FILE02-EOF-SW             PIC X(1).                          00021900
022000 01  FILE02-RECORD.                                               00022000
022100     05 FILE02-LRECL           PIC S9(4) COMP.                    00022100
022200     05 FILE02-SYS-USE         PIC S9(4) COMP.                    00022200
022300     05 FILE02-LOG-REC         PIC X(33000).                      00022300
022400 01  FILE02-JFCB               PIC X(176).                        00022400
022500 01  FILE02-ERROR-CODE         PIC X(176).                        00022500
022600 01  FILE03-PGM                PIC X(8) VALUE 'FILE03'.           00022600
022700 01  FILE03-ENTRY              PIC X(8).                          00022700
022800 01  FILE03-EOF-SW             PIC X(1).                          00022800
022900 01  FILE03-RECORD.                                               00022900
023000          20 FILE03-LRECL            PIC S9(4) COMP.              00023000
023100          20 FILE03-SYS-USE          PIC S9(4) COMP.              00023100
023200          20 FILE03-LOG-REC          PIC X(33000).                00023200
023300 01  FILE03-JFCB               PIC X(176).                        00023300
023400 01  FILE03-ERROR-CODE         PIC 9(04).                         00023400
023500*                                                                 00023500
023600 01  MAX-RECRIX                PIC S9(4) COMP VALUE ZEROES.       00023600
023700 01  SAVE-CONIX                PIC S9(4) COMP VALUE ZEROES.       00023700
023800 01  WS-ALLOC-DSNAME          PIC X(44) VALUE SPACES.             00023800
023900 01  BMGBM3C-NATL-DATA.                                           00023900
024000      05 BMGBM3C-NATL-ARRAY     OCCURS 20000 TIMES                00024000
024100                ASCENDING KEY IS BMGBM3C-NATL-KEY                 00024100
024200                INDEXED BY NATLIX.                                00024200
024300        10 BMGBM3C-NATL-KEY.                                      00024300
024400           15 BMGBM3C-NATL-CUSTOMER-ID        PIC X(5).           00024400
024500           15 BMGBM3C-NATL-CONFIG-ID          PIC X(2).           00024500
024600 01  CONFIG-FILE-DATA.                                            00024600
024700      05 CONFIG-FILE-ARRAY     OCCURS 50000 TIMES                 00024700
024800                ASCENDING KEY IS CONFIG-FILE-KEY                  00024800
024900                INDEXED BY CONIX.                                 00024900
025000        10 CONFIG-FILE-KEY.                                       00025000
025100           15 CONFIG-FILE-CUSTOMER-ID        PIC X(5).            00025100
025200           15 CONFIG-FILE-CONFIG-ID          PIC X(2).            00025200
025300 01  BMGBM3C-RECR-DATA.                                           00025300
025400      05 BMGBM3C-RECR-ARRAY     OCCURS 20000 TIMES                00025400
025500                ASCENDING KEY IS BMGBM3C-RECR-KEY                 00025500
025600                INDEXED BY RECRIX.                                00025600
025700        10 BMGBM3C-RECR-KEY.                                      00025700
025800           15 BMGBM3C-RECR-CUSTOMER-ID        PIC X(05).          00025800
025900           15 BMGBM3C-RECR-CONFIG-ID          PIC X(02).          00025900
026000           15 BMGBM3C-RECR-MAN                PIC X(13).          00026000
026100           15 BMGBM3C-RECR-DSNAME             PIC X(44).          00026100
026200           15 BMGBM3C-RECR-MAN-BILL           PIC X(10).          00026200
026300           15 BMGBM3C-RECR-COUNT             PIC S9(9) USAGE COMP.00026300
026400           15 BMGBM3C-RECR-ORIG               PIC X(02).          00026400
026500 01  WS-FILEID-IND                   PIC X(01) VALUE ' '.         00026500
026600 01  WS-BILL-SYS-ID                  PIC X(01) VALUE ' '.         00026600
026700 01  MAN-BAN-WRITTEN                 PIC X(01) VALUE 'N'.         00026700
026800 01  FIRST-TIME                      PIC X(01) VALUE 'Y'.         00026800
026900 01  FIRST-TIME-FETCH                PIC X(01) VALUE 'Y'.         00026900
027000 01  BAN-CSR-EOF-IND                 PIC X(01) VALUE 'N'.         00027000
027100    88 END-OF-BAN-CSR                          VALUE 'Y'.         00027100
027200    88 NOT-END-OF-BAN-CSR                      VALUE 'N'.         00027200
027300 01  DEALLOC-PGM                     PIC X(8) VALUE 'DEALLOC'.    00027300
027400 01  DEALLOC-DDNAME                  PIC X(8).                    00027400
027500 01  ALLOC-FAILED                    PIC X(01) VALUE 'N'.         00027500
027600 01  FILENAME                        PIC X(44) VALUE SPACES.      00027600
027700 01  CURR-CUSTOMER-ID                PIC X(07) VALUE SPACES.      00027700
027800 01  PREV-CUSTOMER-ID                PIC X(07) VALUE SPACES.      00027800
027900 01  PREV-2-CUSTOMER-ID              PIC X(07) VALUE SPACES.      00027900
028000 01  CURR-BILL                       PIC X(07) VALUE SPACES.      00028000
028100 01  PREV-BILL                       PIC X(07) VALUE SPACES.      00028100
028200 01  PREV-2-BILL                     PIC X(07) VALUE SPACES.      00028200
028300 01  FIRST-QLF                PIC X(08) VALUE SPACES.             00028300
028400 01  SECOND-QLF               PIC X(07) VALUE SPACES.             00028400
028500 01  THIRD-QLF                PIC X(06) VALUE SPACES.             00028500
028600 01  FOURTH-QLF               PIC X(08) VALUE SPACES.             00028600
028700 01  WS-ORIG-SYSTEM-ID               PIC X(02) VALUE SPACES.      00028700
028800 01  NYNE-ORIG-SYSTEM-ID             PIC X(02) VALUE SPACES.      00028800
028900     88 NYNE-ORIG               VALUE '01' '05' '06'.             00028900
029000 01  WS-NATL-CUR                     PIC X(01) VALUE 'N'.         00029000
029100 01  WS-NATL-IND                     PIC X(1) VALUE ' '.          00029100
029200 01  WS-SORT-FILEID                  PIC X(8) VALUE ' '.          00029200
029300 01  WS-NATL-KEY.                                                 00029300
029400     05  WS-NATL-CUSTOMER-ID         PIC X(05).                   00029400
029500     05  WS-NATL-CONFIG-ID           PIC X(02).                   00029500
029600 01  WS-ACCT-SEND-DATE               PIC X(10).                   00029600
029700 01  WS-JUL-CYCL.                                                 00029700
029800     05  WS-JUL-CYCL-1               PIC X(01) VALUE SPACES.      00029800
029900     05  WS-JUL-CYCL-2               PIC X(05) VALUE SPACES.      00029900
030000 01  WS-CYCLE-DATE                   PIC X(06) VALUE SPACES.      00030000
030100 01  WS-CUSTOMER-ID                  PIC X(05) VALUE SPACES.      00030100
030200 01  WS-CONFIG                       PIC X(05) VALUE SPACES.      00030200
030300 01  WS-WRITE-FILELIST               PIC X(1) VALUE 'N'.          00030300
030400 01  WS-CUST-LABEL.                                               00030400
030500     05 WS-CUST-CUSTOMERID           PIC X(5).                    00030500
030600     05 WS-CUST-CONFIGID             PIC X(5).                    00030600
030700 01  WS-MAN-BILL-DATE                PIC X(10).                   00030700
030800 01  WS-TOT-BILL-AMT                 PIC S9(9)V9(2) USAGE COMP-3. 00030800
030900 01  WS-EOC-MAN                      PIC X(1) VALUE 'N'.          00030900
031000 01  WS-EOC-PRC                      PIC X(1) VALUE 'N'.          00031000
031100 01  WS-CONFIG-FOUND                 PIC X(1) VALUE 'Y'.          00031100
031200 01  WS-CONFIG-FOUND-1               PIC X(1) VALUE 'Y'.          00031200
031300 01  WS-TEMP-MAN-FOUND               PIC X(1) VALUE 'Y'.          00031300
031400 01  WS-BILL-DIFF                    PIC X(1) VALUE 'N'.          00031400
031500 01  WS-RELEASE-IND                  PIC X(1) VALUE 'D'.          00031500
031600 01  WS-REL-FLAG                     PIC X(1) VALUE 'N'.          00031600
031700 01  WS-MASTER-MAX                   PIC 9(6) VALUE 50000.        00031700
031800 01  WS-RECR-CUR                     PIC X(1) VALUE 'N'.          00031800
031900 01  MASTER-ARRAY.                                                00031900
032000      05 M-DAT-LIN           OCCURS 1 TO 50000                    00032000
032100                     DEPENDING ON WS-M-COUNT                      00032100
032200                ASCENDING KEY IS M-CUST-LB,                       00032200
032300                                M-MAN                             00032300
032400                    INDEXED BY M-INX.                             00032400
032500          10  M-CUST-LB              PIC X(07).                   00032500
032600          10  M-MAN                  PIC X(13).                   00032600
032700          10  M-EFFECTIVE-DT         PIC X(10).                   00032700
032800 01  WS-TEMP-MAX                     PIC 9(6) VALUE 50000.        00032800
032900 01  TEMP-ARRAY.                                                  00032900
033000      05 T-DAT-LIN       OCCURS 1 TO 50000                        00033000
033100                        DEPENDING ON WS-T-COUNT                   00033100
033200                ASCENDING KEY IS T-CUST-LB,                       00033200
033300                           T-MAN, T-MAN-BILL-DATE                 00033300
033400                INDEXED BY T-INX.                                 00033400
033500          10  T-CUST-LB              PIC X(07).                   00033500
033600          10  T-MAN                  PIC X(13).                   00033600
033700          10  T-MAN-BILL-DATE        PIC X(10).                   00033700
033800          10  T-ORIG-SYSTEM-ID       PIC X(02).                   00033800
033900          10  T-VZ450-DSNAME         PIC X(44).                   00033900
034000          10  T-VAM-LOAD-DATE        PIC X(10).                   00034000
034100          10  T-LOB-IND              PIC X(18).                   00034100
034200                                                                  00034200
034300 01  WS-MAN-CUST-LB.                                              00034300
034400          10  WS-MAN-CUSTOMER-ID    PIC X(05).                    00034400
034500          10  WS-MAN-CONFIG-ID      PIC X(02).                    00034500
034600 01  WS-PRC-CUST-LB.                                              00034600
034700          10  WS-PRC-CUSTOMER-ID    PIC X(05).                    00034700
034800          10  WS-PRC-CONFIG-ID      PIC X(02).                    00034800
034900 01  WS-PRC-MN-YR               PIC X(07) VALUE SPACES.           00034900
035000 01  WS-BMCONPRC-MN-YR          PIC X(10) VALUE SPACES.           00035000
035100 01  WS-PRE-PRC-CUST-LB         PIC X(07) VALUE SPACES.           00035100
035200 01  WS-PRE-PRC-MN-YR           PIC X(10) VALUE SPACES.           00035200
035300 01  WS-PRE-PRC-MN-YR-T         PIC X(07) VALUE SPACES.           00035300
035400 01  WS-PRE-PRC-BILL-DATE       PIC X(02) VALUE SPACES.           00035400
035500 01  WS-PRE-SER-CUST-LB         PIC X(07) VALUE SPACES.           00035500
035600 01  WS-COMP-CONFIG             PIC X(07) VALUE SPACES.           00035600
035700 01  WS-COMP-CONFIG-1           PIC X(07) VALUE SPACES.           00035700
035800 01  WS-PRE-SER-MAN             PIC X(13) VALUE SPACES.           00035800
035900 01  WS-PRE-SER-MAN-T           PIC X(13) VALUE SPACES.           00035900
036000 01  WS-ACCT-ST-IND             PIC X(01) VALUE SPACES.           00036000
036100 01  WS-M-COUNT                 PIC 9(08) VALUE IS 0.             00036100
036200 01  WS-R-COUNT                 PIC 9(08) VALUE IS 0.             00036200
036300 01  WS-T-COUNT                 PIC 9(08) VALUE IS 0.             00036300
036400 01  WS-PREV-MAN-BILL-DATE      PIC X(10) VALUE SPACES.           00036400
036500 01  WS-EXTR-FB-TRIGGER-COUNT   PIC 9(9) VALUE ZEROES.            00036500
036600                                                                  00036600
036700 01  EXTRACT-CNTL-REC.                                            00036700
036800     05 EXTR-MAN                   PIC X(13).                     00036800
036900     05 EXTR-BAN                   PIC X(13).                     00036900
037000     05 EXTR-VZ450-DSNAME          PIC X(44).                     00037000
037100     05 EXTR-CUST-LABEL            PIC X(8).                      00037100
037200     05 EXTR-MAN-BILL-DATE         PIC X(10).                     00037200
037300     05 EXTR-BILL-DATE             PIC X(10).                     00037300
037400     05 EXTR-LOAD-DATE             PIC X(10).                     00037400
037500     05 EXTR-LAST-LOAD-DATE        PIC X(10).                     00037500
037600     05 EXTR-CORP-MASTER-IP        PIC X(13).                     00037600
037700     05 EXTR-CUST-BILLING-IP       PIC X(13).                     00037700
037800     05 EXTR-FB-TRIGGER-COUNT      PIC 9(02).                     00037800
037900* START OF CHANGES - NOV RELEASE                                  00037900
038000 01  WS-EXTR-CUST-LABLE            PIC 9(7).                      00038000
038100* END OF CHANGES - NOV RELEASE                                    00038100
038200 01  REPT-CNTL-REC.                                               00038200
038300     05 REPT-MAN                   PIC X(13).                     00038300
038400     05 WS-FILLER1                 PIC X(02).                     00038400
038500     05 REPT-CUST-LABEL            PIC X(07).                     00038500
038600     05 WS-FILLER2                 PIC X(02).                     00038600
038700     05 REPT-MAN-BILL-DATE         PIC X(10).                     00038700
038800     05 WS-FILLER3                 PIC X(02).                     00038800
038900     05 REPT-IND                   PIC X(01).                     00038900
039000                                                                  00039000
039100 01 WS-CONFIG-THRES                  PIC 9(4) VALUE ZEROES.       00039100
039200 01 ACCT-THRES                       PIC 9(5) VALUE ZEROES.       00039200
039300 01 MAX-THRES                        PIC 9(4) VALUE ZEROES.       00039300
039310 01 WS-INPROGRESS-COUNT              PIC S9(9) COMP VALUE 0.              
039320 01 WS-RECR-CUSTOMER-ID            PIC X(05) VALUE SPACES.              00
039330 01 WS-RECR-CONFIG-ID              PIC X(02) VALUE SPACES.              00
039340 01 WS-RECR-BILL-DATE              PIC X(10) VALUE SPACES.              00
039350 01 VAMS-VIPS-IND                  PIC X(1).                              
039351 01 XVAMS-DSNAME                   PIC X(44).                             
039360 01 XVIPS-DSNAME                   PIC X(44).                             
039400                                                                  00039400
039500 EJECT                                                            00039500
039600******************************************************************00039600
039700 LINKAGE SECTION.                                                 00039700
039800******************************************************************00039800
039900* LK-DATA IS COMMA DELIMITED - 1ST PARM IS DB2 SUBSYSTEM ID       00039900
040000*                            - 2ND PARM IS DB2 PLAN NAME          00040000
040100 01  LINKAGE-PARMS.                                               00040100
040200     05 LK-LNG                   PIC S9(4) COMP.                  00040200
040300     05 LK-DATA                  PIC X(254).                      00040300
040400 EJECT                                                            00040400
040500******************************************************************00040500
040600 PROCEDURE DIVISION USING LINKAGE-PARMS.                          00040600
040700******************************************************************00040700
040800                                                                  00040800
040900     DISPLAY '------STARTING BMGBM3C PROGRAM------------- ' .     00040900
041000                                                                  00041000
041100     PERFORM A000-SET-UP-PGM                                      00041100
041200        THRU A000-SET-UP-PGM-X.                                   00041200
041300                                                                  00041300
041400     PERFORM B100-MAIN-PROCESS                                    00041400
041500        THRU B100-MAIN-PROCESS-X.                                 00041500
041600                                                                  00041600
041700     PERFORM B400-APPEND-MANUAL-LIST                              00041700
041800        THRU B400-APPEND-MANUAL-LIST-X.                           00041800
041900                                                                  00041900
042000     PERFORM C000-FINISH-PGM                                      00042000
042100        THRU C000-FINISH-PGM-X.                                   00042100
042200                                                                  00042200
042300       GOBACK.                                                    00042300
042400 EJECT                                                            00042400
042500 A000-SET-UP-PGM.                                                 00042500
042600     PERFORM A010-PARSE-LINKAGE                                   00042600
042700        THRU A010-PARSE-LINKAGE-X.                                00042700
042800                                                                  00042800
042900     PERFORM A020-ALLOC-REPORT                                    00042900
043000        THRU A020-ALLOC-REPORT.                                   00043000
043100                                                                  00043100
043200     MOVE SPACES       TO FILE01-DSNAME.                          00043200
043300     MOVE 'CREATE'     TO THREADIO-ENTRY.                         00043300
043400     CALL THREADIO-PGM USING THREADIO-PARMS.                      00043400
043500                                                                  00043500
043600     OPEN OUTPUT FILE-LISTA.                                      00043600
043700     OPEN OUTPUT FILE-LISTB.                                      00043700
043800     OPEN OUTPUT FILE-LISTC.                                      00043800
043900     OPEN OUTPUT FILE-LISTD.                                      00043900
044000     OPEN OUTPUT FILE-LISTE.                                      00044000
044100     OPEN OUTPUT FILE-LISTV.                                      00044100
044200     OPEN OUTPUT FILE-LISTW.                                      00044200
044300     OPEN OUTPUT FILE-LISTX.                                      00044300
044400     OPEN OUTPUT FILE-LISTY.                                      00044400
044500     OPEN OUTPUT FILE-LISTZ.                                      00044500
044600                                                                  00044600
044700     MOVE 'Y'          TO FIRST-TIME                              00044700
044800                                                                  00044800
044900     INITIALIZE EXTRACT-CNTL-REC.                                 00044900
045000                                                                  00045000
045100     SET RECRIX TO  1.                                            00045100
045200        PERFORM UNTIL                                             00045200
045300               RECRIX > 20000                                     00045300
045400           INITIALIZE BMGBM3C-RECR-ARRAY (RECRIX)                 00045400
045500           SET     RECRIX        UP BY 1                          00045500
045600        END-PERFORM.                                              00045600
045700     SET M-INX TO  1.                                             00045700
045800        PERFORM UNTIL                                             00045800
045900                  M-INX > WS-MASTER-MAX                           00045900
046000           INITIALIZE M-DAT-LIN(M-INX)                            00046000
046100           SET     M-INX         UP BY 1                          00046100
046200        END-PERFORM.                                              00046200
046300     SET M-INX      TO  1.                                        00046300
046400     SET T-INX      TO  1.                                        00046400
046500        PERFORM UNTIL                                             00046500
046600                  T-INX > WS-TEMP-MAX                             00046600
046700           INITIALIZE T-DAT-LIN(T-INX)                            00046700
046800           SET     T-INX         UP BY 1                          00046800
046900        END-PERFORM.                                              00046900
047000     SET T-INX      TO 1.                                         00047000
047100     SET CONIX      TO 1.                                         00047100
047200     MOVE 1      TO SAVE-CONIX.                                   00047200
047300     MOVE SPACES TO WS-MAN-CUST-LB.                               00047300
047400     MOVE SPACES TO WS-PRC-CUST-LB                                00047400
047500     MOVE 'N'    TO WS-BILL-DIFF.                                 00047500
047600                                                                  00047600
047700     PERFORM A030-OPEN-NATL-IND                                   00047700
047800        THRU A030-OPEN-NATL-IND-X.                                00047800
047900                                                                  00047900
048000     EXEC SQL                                                     00048000
048100          OPEN MAN_CUR                                            00048100
048200     END-EXEC.                                                    00048200
048300                                                                  00048300
048400     EVALUATE SQLCODE                                             00048400
048500     WHEN +000                                                    00048500
048600       PERFORM A050-FETCH-MAN-CURSOR-1-ROW                        00048600
048700          THRU A050-FETCH-MAN-CURSOR-1-ROW-X                      00048700
048800     WHEN OTHER                                                   00048800
048900        DISPLAY '!!! ERROR OPEN MAN_CUR !!!'                      00048900
049000        PERFORM U000-DISPLAY-DB2-ERROR-MSG                        00049000
049100           THRU U000-DISPLAY-DB2-ERROR-MSG-X                      00049100
049200     END-EVALUATE.                                                00049200
049300                                                                  00049300
049400     EXEC SQL                                                     00049400
049500          OPEN PRC_CUR                                            00049500
049600     END-EXEC.                                                    00049600
049700                                                                  00049700
049800     EVALUATE SQLCODE                                             00049800
049900     WHEN +000                                                    00049900
050000       PERFORM A060-FETCH-PRC-CURSOR-1-ROW                        00050000
050100          THRU A060-FETCH-PRC-CURSOR-1-ROW-X                      00050100
050200     WHEN OTHER                                                   00050200
050300        DISPLAY '!!! ERROR OPEN MAN_CUR !!!'                      00050300
050400        PERFORM U000-DISPLAY-DB2-ERROR-MSG                        00050400
050500           THRU U000-DISPLAY-DB2-ERROR-MSG-X                      00050500
050600     END-EVALUATE.                                                00050600
050700                                                                  00050700
050800     EXEC SQL                                                     00050800
050900         SELECT PARM_VALUE                                        00050900
051000         INTO :PARMXXXT-PARM-VALUE                                00051000
051100         FROM PARM_TABLE                                          00051100
051200         WHERE PARM_NAME = 'CONFIG_THRESHOLD'                     00051200
051300     END-EXEC                                                     00051300
051400                                                                  00051400
051500     EVALUATE SQLCODE                                             00051500
051600     WHEN 0                                                       00051600
051700          MOVE PARMXXXT-PARM-VALUE-TEXT(1:4)                      00051700
051800               TO MAX-THRES                                       00051800
051900     WHEN 100                                                     00051900
052000          DISPLAY 'SQLCODE : ' SQLCODE                            00052000
052100          DISPLAY 'NO MATCHING ENTRIES IN PARM TABLE '            00052100
052200          PERFORM U000-DISPLAY-DB2-ERROR-MSG                      00052200
052300             THRU U000-DISPLAY-DB2-ERROR-MSG-X                    00052300
052400          GOBACK                                                  00052400
052500     WHEN OTHER                                                   00052500
052600          DISPLAY 'SQLCODE : ' SQLCODE                            00052600
052700          DISPLAY 'ERROR WHILE ACCESSING PARM-TABLE '             00052700
052800                  ' FOR PARM KEY  = BILL_MANAGER_UPDATE'          00052800
052900          PERFORM U000-DISPLAY-DB2-ERROR-MSG                      00052900
053000             THRU U000-DISPLAY-DB2-ERROR-MSG-X                    00053000
053100          GOBACK                                                  00053100
053200     END-EVALUATE.                                                00053200
053300                                                                  00053300
053400     EXEC SQL                                                     00053400
053500         SELECT PARM_VALUE                                        00053500
053600         INTO :PARMXXXT-PARM-VALUE                                00053600
053700         FROM PARM_TABLE                                          00053700
053800         WHERE PARM_NAME = 'SPLIT RECREATES'                      00053800
053900     END-EXEC                                                     00053900
054000                                                                  00054000
054100     EVALUATE SQLCODE                                             00054100
054200     WHEN 0                                                       00054200
054300          MOVE PARMXXXT-PARM-VALUE-TEXT(1:1)                      00054300
054400               TO SPLIT-RECR                                      00054400
054500     WHEN 100                                                     00054500
054600          MOVE 'Y' TO SPLIT-RECR                                  00054600
054700          DISPLAY 'SQLCODE : ' SQLCODE                            00054700
054800          DISPLAY 'NO MATCHING ENTRIES IN PARM FOR SPLIT RECR'    00054800
054900          PERFORM U000-DISPLAY-DB2-ERROR-MSG                      00054900
055000             THRU U000-DISPLAY-DB2-ERROR-MSG-X                    00055000
055100     WHEN OTHER                                                   00055100
055200          MOVE 'Y' TO SPLIT-RECR                                  00055200
055300          DISPLAY 'SQLCODE : ' SQLCODE                            00055300
055400          DISPLAY 'ERROR WHILE ACCESSING PARM-TABLE '             00055400
055500                  ' FOR PARM KEY  = SPLIT RECREATES'              00055500
055600          PERFORM U000-DISPLAY-DB2-ERROR-MSG                      00055600
055700             THRU U000-DISPLAY-DB2-ERROR-MSG-X                    00055700
055800     END-EVALUATE.                                                00055800
055900 A000-SET-UP-PGM-X.                                               00055900
056000     EXIT.                                                        00056000
056100                                                                  00056100
056200 A010-PARSE-LINKAGE.                                              00056200
056300     MOVE LK-LNG               TO PARSLNKG-LNG.                   00056300
056400     MOVE LK-DATA              TO PARSLNKG-DATA.                  00056400
056500                                                                  00056500
056600     CALL PARSLNKG-PGM USING PARSLNKG-PARMS.                      00056600
056700                                                                  00056700
056800     MOVE PARSLNKG-LK-PARM (1) TO THREADIO-DB2-SUBSYSTEM.         00056800
056900     MOVE PARSLNKG-LK-PARM (2) TO THREADIO-PLAN.                  00056900
057000     MOVE PARSLNKG-LK-PARM (3) TO THREADIO-COLLECTION.            00057000
057100     MOVE PARSLNKG-LK-PARM (4) TO WS-JUL-CYCL.                    00057100
057200                                                                  00057200
057300 A010-PARSE-LINKAGE-X.                                            00057300
057400     EXIT.                                                        00057400
057500                                                                  00057500
057600 A020-ALLOC-REPORT.                                               00057600
057700     STRING 'BMGNY0PN.BMGBM3C.REPORT.' WS-JUL-CYCL                00057700
057800       DELIMITED BY SIZE INTO FILE01-DSNAME                       00057800
057900     MOVE  10                        TO ALLOFILE-NUM-PARMS        00057900
058000     MOVE 'DDNAME=STRIPOUT'          TO ALLOFILE-PARM (1).        00058000
058100     MOVE 'DSNAME='                  TO ALLOFILE-PARM (2).        00058100
058200     MOVE FILE01-DSNAME              TO ALLOFILE-PARM (2)(8:30).  00058200
058300* START OF CHANGES - NOV RELEASE                                  00058300
058400     IF THREADIO-DB2-SUBSYSTEM NOT = 'D69X' AND                   00058400
058420        THREADIO-DB2-SUBSYSTEM(1:3) NOT = 'DB2'                           
058500       MOVE 'BMGVZ0CN'                 TO ALLOFILE-PARM (2)(8:8)  00058500
058600     END-IF                                                       00058600
058700* END OF CHANGES - NOV RELEASE                                    00058700
058800     MOVE 'DISP=(NEW,CATLG,CATLG)'   TO ALLOFILE-PARM (3).        00058800
058900     MOVE 'BUFLEN=32760'             TO ALLOFILE-PARM (4).        00058900
059000     MOVE 'FREE=CLOSE'               TO ALLOFILE-PARM (5).        00059000
059100     MOVE 'MGMTCLAS=NOBK45'          TO ALLOFILE-PARM (6).        00059100
059200     MOVE 'DATACLAS=COMPRESS'        TO ALLOFILE-PARM (7).        00059200
059300     MOVE 'DCB=(LRECL=80,RECFM=FB)'  TO ALLOFILE-PARM (8).        00059300
059400     MOVE 'SCRATCH=TRUE'             TO ALLOFILE-PARM (9).        00059400
059500     MOVE 'SPACE=(CYL,(10,10),RLSE)' TO ALLOFILE-PARM (10).       00059500
059600     CALL ALLOFILE-PGM USING ALLOFILE-PARMS                       00059600
059700     MOVE ALLOFILE-ERROR-CODE TO STRIPIO-ERROR-CODE               00059700
059800     IF ALLOFILE-ERROR-CODE NOT = 0                               00059800
059900       MOVE 'DISP=(NEW,CATLG,DELETE)' TO ALLOFILE-PARM (3)        00059900
060000       MOVE 'BMGVZ0CN'               TO ALLOFILE-PARM (2)(8:8)    00060000
060100       CALL ALLOFILE-PGM USING ALLOFILE-PARMS                     00060100
060200        MOVE ALLOFILE-ERROR-CODE TO STRIPIO-ERROR-CODE            00060200
060300     END-IF                                                       00060300
060400     IF STRIPIO-ERROR-CODE EQUAL ZERO                             00060400
060500          MOVE 'OPENFLOT' TO STRIPIO-ENTRY                        00060500
060600          PERFORM Z000-CALL-STRIPIO-PGM                           00060600
060700             THRU Z000-CALL-STRIPIO-PGM-X                         00060700
060800          MOVE '0' TO STRIPIO-EOF-SW                              00060800
060900     END-IF.                                                      00060900
061000                                                                  00061000
061100     MOVE 'BMGNY0PN'     TO FIRST-QLF                             00061100
061200     MOVE 'BMGBM3C'      TO SECOND-QLF                            00061200
061300     MOVE 'NOTREL'       TO THIRD-QLF                             00061300
061400     MOVE WS-JUL-CYCL   TO FOURTH-QLF                             00061400
061500     STRING FIRST-QLF '.' SECOND-QLF '.'                          00061500
061600            THIRD-QLF '.' FOURTH-QLF                              00061600
061700     DELIMITED BY SIZE INTO WS-ALLOC-DSNAME                       00061700
061800     END-STRING                                                   00061800
061900     MOVE WS-ALLOC-DSNAME            TO WORK-DSNAME               00061900
062000     MOVE 10                         TO ALLOFILE-NUM-PARMS        00062000
062100     MOVE 'DDNAME=FILE03'            TO ALLOFILE-PARM (1).        00062100
062200     MOVE 'DSNAME='                  TO ALLOFILE-PARM (2).        00062200
062300     MOVE WORK-DSNAME                TO ALLOFILE-PARM (2)(8:44).  00062300
062310     IF THREADIO-DB2-SUBSYSTEM NOT = 'D69X' AND                           
062320        THREADIO-DB2-SUBSYSTEM(1:3) NOT = 'DB2'                           
062500       MOVE 'BMGVZ0CN'                 TO ALLOFILE-PARM (2)(8:8)  00062500
062600     END-IF                                                       00062600
062700     MOVE 'DISP=(NEW,CATLG,CATLG)'   TO ALLOFILE-PARM (3).        00062700
062800     MOVE 'BUFLEN=32760'             TO ALLOFILE-PARM (4).        00062800
062900     MOVE 'FREE=CLOSE'               TO ALLOFILE-PARM (5).        00062900
063000     MOVE 'MGMTCLAS=NOBK45'          TO ALLOFILE-PARM (6).        00063000
063100     MOVE 'DATACLAS=COMPRESS'        TO ALLOFILE-PARM (7).        00063100
063200     MOVE 'DCB=(LRECL=100,RECFM=FB)'   TO ALLOFILE-PARM (8).      00063200
063300     MOVE 'SCRATCH=TRUE'             TO ALLOFILE-PARM (9).        00063300
063400     MOVE 'SPACE=(CYL,(15,15),RLSE)' TO ALLOFILE-PARM (10).       00063400
063500     CALL ALLOFILE-PGM USING ALLOFILE-PARMS.                      00063500
063600     MOVE ALLOFILE-ERROR-CODE TO FILE03-ERROR-CODE                00063600
063700     IF ALLOFILE-ERROR-CODE NOT = 0                               00063700
063800       MOVE 3                        TO ALLOFILE-NUM-PARMS        00063800
063900       MOVE 'DISP=SHR'               TO ALLOFILE-PARM (3)         00063900
064000       CALL ALLOFILE-PGM USING ALLOFILE-PARMS                     00064000
064100       MOVE ALLOFILE-ERROR-CODE TO FILE03-ERROR-CODE              00064100
064200     END-IF.                                                      00064200
064300     MOVE 'OPENOUT'  TO FILE03-ENTRY.                             00064300
064400     PERFORM Z020-CALL-FILE03-PGM                                 00064400
064500        THRU Z020-CALL-FILE03-PGM-X.                              00064500
064600 A020-ALLOC-REPORT-X.                                             00064600
064700     EXIT.                                                        00064700
064800                                                                  00064800
064900 A030-OPEN-NATL-IND.                                              00064900
065000      EXEC SQL                                                    00065000
065100          OPEN NATL_CUR                                           00065100
065200      END-EXEC.                                                   00065200
065300      EVALUATE SQLCODE                                            00065300
065400          WHEN 000                                                00065400
065500               PERFORM A040-FETCH-NATL-IND                        00065500
065600                  THRU A040-FETCH-NATL-IND-X                      00065600
065700                                UNTIL WS-NATL-CUR = 'Y'           00065700
065800          WHEN OTHER                                              00065800
065900               DISPLAY 'SQLCODE : ' SQLCODE                       00065900
066000               DISPLAY 'ERROR WHILE OPENING THE NATL_CUR'         00066000
066100                       ' FOR NATIONALIND'                         00066100
066200               PERFORM U000-DISPLAY-DB2-ERROR-MSG                 00066200
066300                  THRU U000-DISPLAY-DB2-ERROR-MSG-X               00066300
066400      END-EVALUATE.                                               00066400
066500      EXEC SQL                                                    00066500
066600          CLOSE NATL_CUR                                          00066600
066700      END-EXEC.                                                   00066700
066800 A030-OPEN-NATL-IND-X.                                            00066800
066900      EXIT.                                                       00066900
067000                                                                  00067000
067100 A040-FETCH-NATL-IND.                                             00067100
067200      EXEC SQL                                                    00067200
067300           FETCH NATL_CUR INTO :BMCONFGT-CUSTOMER-ID,             00067300
067400                               :BMCONFGT-CONFIG-ID                00067400
067500      END-EXEC.                                                   00067500
067600      EVALUATE SQLCODE                                            00067600
067700          WHEN 000                                                00067700
067800            MOVE BMCONFGT-CUSTOMER-ID TO                          00067800
067900                          BMGBM3C-NATL-CUSTOMER-ID (NATLIX)       00067900
068000            MOVE BMCONFGT-CONFIG-ID   TO                          00068000
068100                          BMGBM3C-NATL-CONFIG-ID   (NATLIX)       00068100
068200            SET NATLIX UP BY 1                                    00068200
068300          WHEN 100                                                00068300
068400               MOVE 'Y' TO WS-NATL-CUR                            00068400
068500          WHEN OTHER                                              00068500
068600               DISPLAY 'SQLCODE : ' SQLCODE                       00068600
068700               DISPLAY 'ERROR WHILE FETCH THE NATL_CUR'           00068700
068800                       ' FOR NATIONALIND'                         00068800
068900               PERFORM U000-DISPLAY-DB2-ERROR-MSG                 00068900
069000                  THRU U000-DISPLAY-DB2-ERROR-MSG-X               00069000
069100      END-EVALUATE.                                               00069100
069200 A040-FETCH-NATL-IND-X.                                           00069200
069300      EXIT.                                                       00069300
069400                                                                  00069400
069500 A050-FETCH-MAN-CURSOR-1-ROW.                                     00069500
069600     EXEC SQL                                                     00069600
069700        FETCH MAN_CUR INTO    :BMCONMAN-CUSTOMER-ID,              00069700
069800                              :BMCONMAN-CONFIG-ID,                00069800
069900                              :BMCONMAN-MAN,                      00069900
070000                              :BMCONMAN-EFFECTIVE-DT              00070000
070100     END-EXEC.                                                    00070100
070200     EVALUATE SQLCODE                                             00070200
070300     WHEN 100                                                     00070300
070400        MOVE 'Y' TO WS-EOC-MAN                                    00070400
070500          EXEC SQL                                                00070500
070600              CLOSE MAN_CUR                                       00070600
070700          END-EXEC                                                00070700
070800     WHEN 0                                                       00070800
070900       CONTINUE                                                   00070900
071000     WHEN OTHER                                                   00071000
071100        DISPLAY '!!! ERROR FETCH CON_CURSOR !!!'                  00071100
071200        PERFORM U000-DISPLAY-DB2-ERROR-MSG                        00071200
071300           THRU U000-DISPLAY-DB2-ERROR-MSG-X                      00071300
071400     END-EVALUATE.                                                00071400
071500 A050-FETCH-MAN-CURSOR-1-ROW-X.                                   00071500
071600     EXIT.                                                        00071600
071700                                                                  00071700
071800 A060-FETCH-PRC-CURSOR-1-ROW.                                     00071800
071900     EXEC SQL                                                     00071900
072000        FETCH PRC_CUR INTO    :BMCONPRC-CUSTOMER-ID,              00072000
072100                              :BMCONPRC-CONFIG-ID,                00072100
072200                              :BMCONPRC-MAN,                      00072200
072300                              :BMCONPRC-MAN-BILL-DATE,            00072300
072400                              :BMCONPRC-ORIG-SYSTEM-ID,           00072400
072500                              :BMCONPRC-VZ450-DSNAME,             00072500
072600                              :BMCONPRC-VAM-LOAD-DATE,            00072600
072700                              :BMCONPRC-LOB-IND                   00072700
072800     END-EXEC.                                                    00072800
072900     EVALUATE SQLCODE                                             00072900
073000     WHEN 100                                                     00073000
073100        MOVE 'Y' TO WS-EOC-PRC                                    00073100
073200          EXEC SQL                                                00073200
073300              CLOSE PRC_CUR                                       00073300
073400          END-EXEC                                                00073400
073500     WHEN 0                                                       00073500
073600       CONTINUE                                                   00073600
073700     WHEN OTHER                                                   00073700
073800        DISPLAY '!!! ERROR FETCH PRC_CURSOR !!!'                  00073800
073900        PERFORM U000-DISPLAY-DB2-ERROR-MSG                        00073900
074000           THRU U000-DISPLAY-DB2-ERROR-MSG-X                      00074000
074100     END-EVALUATE.                                                00074100
074200 A060-FETCH-PRC-CURSOR-1-ROW-X.                                   00074200
074300     EXIT.                                                        00074300
074400                                                                  00074400
074500 B100-MAIN-PROCESS.                                               00074500
074600     IF WS-JUL-CYCL(1:1) = 'M'                                    00074600
074700        MOVE 'A' TO DETERMINE-FILE                                00074700
074800        ELSE                                                      00074800
074900           IF WS-JUL-CYCL(1:1) = 'E'                              00074900
075000              MOVE 'V' TO DETERMINE-FILE                          00075000
075100           END-IF                                                 00075100
075200     END-IF                                                       00075200
075300     MOVE SPACE          TO RECR-MOVE-IND                         00075300
075400     PERFORM B110-LOAD-MASTER-ARRAY                               00075400
075500        THRU B110-LOAD-MASTER-ARRAY-X UNTIL WS-EOC-MAN = 'Y'.     00075500
075600                                                                  00075600
075700     PERFORM B120-INTER-PROCESS                                   00075700
075800        THRU B120-INTER-PROCESS-X UNTIL WS-EOC-PRC = 'Y'.         00075800
075900                                                                  00075900
076000     INITIALIZE EXTRACT-CNTL-REC.                                 00076000
076100                                                                  00076100
076200     PERFORM B300-ADD-RECREATE-CONFIG                             00076200
076300        THRU B300-ADD-RECREATE-CONFIG-X.                          00076300
076400                                                                  00076400
076500 B100-MAIN-PROCESS-X.                                             00076500
076600     EXIT.                                                        00076600
076700                                                                  00076700
076800 B110-LOAD-MASTER-ARRAY.                                          00076800
076900                                                                  00076900
077000     MOVE BMCONMAN-CUSTOMER-ID     TO  WS-MAN-CUSTOMER-ID         00077000
077100     MOVE BMCONMAN-CONFIG-ID       TO  WS-MAN-CONFIG-ID           00077100
077200     MOVE WS-MAN-CUST-LB           TO  M-CUST-LB(M-INX).          00077200
077300     MOVE BMCONMAN-MAN             TO  M-MAN(M-INX).              00077300
077400     MOVE BMCONMAN-EFFECTIVE-DT    TO  M-EFFECTIVE-DT(M-INX).     00077400
077500     SET M-INX                 UP BY 1.                           00077500
077600     ADD 1 TO WS-M-COUNT.                                         00077600
077700     PERFORM A050-FETCH-MAN-CURSOR-1-ROW                          00077700
077800        THRU A050-FETCH-MAN-CURSOR-1-ROW-X.                       00077800
077900                                                                  00077900
078000 B110-LOAD-MASTER-ARRAY-X.                                        00078000
078100     EXIT.                                                        00078100
078200                                                                  00078200
078300 B120-INTER-PROCESS.                                              00078300
078400       MOVE BMCONPRC-CUSTOMER-ID         TO  WS-PRC-CUSTOMER-ID.  00078400
078500       MOVE BMCONPRC-CONFIG-ID           TO  WS-PRC-CONFIG-ID.    00078500
078600       MOVE WS-PRC-CUST-LB               TO  WS-PRE-PRC-CUST-LB.  00078600
078700       MOVE BMCONPRC-MAN-BILL-DATE       TO  WS-PRE-PRC-MN-YR     00078700
078800                                             WS-BMCONPRC-MN-YR.   00078800
078900                                                                  00078900
079000       MOVE 'D' TO WS-RELEASE-IND.                                00079000
079100       SET T-INX TO 1.                                            00079100
079200                                                                  00079200
079300       PERFORM B130-LOAD-TEPARR                                   00079300
079400          THRU B130-LOAD-TEPARR-X UNTIL                           00079400
079500       (WS-PRC-CUST-LB NOT EQUAL TO  WS-PRE-PRC-CUST-LB)  OR      00079500
079600       (WS-PRC-CUST-LB EQUAL TO  WS-PRE-PRC-CUST-LB AND           00079600
079700        WS-BMCONPRC-MN-YR  NOT EQUAL TO   WS-PRE-PRC-MN-YR)  OR   00079700
079800        WS-EOC-PRC   = 'Y'.                                       00079800
079900                                                                  00079900
080000       SET    M-INX        TO    1.                               00080000
080100       SET    T-INX        TO    1.                               00080100
080200                                                                  00080200
080300                                                                  00080300
080400       PERFORM B140-VALIDATE-PARA                                 00080400
080500          THRU B140-VALIDATE-PARA-X.                              00080500
080600                                                                  00080600
080700       PERFORM B180-CHECK-ALLOC                                   00080700
080800          THRU B180-CHECK-ALLOC-X.                                00080800
080900                                                                  00080900
081000       IF WS-RELEASE-IND = 'Y' AND                                00081000
081100                  WS-CONFIG-THRES <= MAX-THRES THEN               00081100
081200         IF DETERMINE-FILE-TYPE = 'Y'                             00081200
081300            MOVE 'N' TO DETERMINE-FILE-TYPE                       00081300
081400            PERFORM B121-DETERMINE-FILE                           00081400
081500               THRU B121-DETERMINE-FILE-X                         00081500
081600         END-IF                                                   00081600
081700         ADD 1      TO WS-CONFIG-THRES                            00081700
081800         SET T-INX  TO    1                                       00081800
081900******  CREATING FILELIST FILE *************                      00081900
082000         PERFORM UNTIL                                            00082000
082100                  T-INX > WS-T-COUNT                              00082100
082200          INITIALIZE REPT-CNTL-REC                                00082200
082300          ADD 1 TO ACCT-THRES                                     00082300
082400                                                                  00082400
082500          IF ACCT-THRES = 1200 OR WS-CONFIG-THRES = MAX-THRES     00082500
082600             MOVE 'Y' TO DETERMINE-FILE-TYPE                      00082600
082700          END-IF                                                  00082700
082800          PERFORM B123-STORE-CONFIG-WRITTEN                       00082800
082900             THRU B123-STORE-CONFIG-WRITTEN-X                     00082900
083000          MOVE T-CUST-LB(T-INX)        TO  EXTR-CUST-LABEL        00083000
083100                                           REPT-CUST-LABEL        00083100
083200          MOVE T-MAN(T-INX)            TO  EXTR-MAN               00083200
083300                                           REPT-MAN               00083300
083400          MOVE T-VZ450-DSNAME(T-INX)   TO  EXTR-VZ450-DSNAME      00083400
083500          MOVE T-MAN-BILL-DATE(T-INX)  TO  EXTR-MAN-BILL-DATE     00083500
083600                                           REPT-MAN-BILL-DATE     00083600
083700          MOVE 'N' TO WS-FILEID-IND                               00083700
083800          PERFORM B190-FIND-FILEID                                00083800
083900             THRU B190-FIND-FILEID-X                              00083900
084000          MOVE WS-SORT-FILEID          TO  EXTR-LOAD-DATE (1:8)   00084000
084100* START OF CHANGES - NOV RELEASE                                  00084100
084200          MOVE EXTR-CUST-LABEL  TO   WS-EXTR-CUST-LABLE           00084200
084300          IF  WS-EXTR-CUST-LABLE IS NUMERIC                       00084300
084400             PERFORM B122-WRITE-OUTPUT                            00084400
084500                THRU B122-WRITE-OUTPUT-X                          00084500
084600          ELSE                                                    00084600
084700          DISPLAY 'NOT NUMERIC CUS||CONFIG....' WS-EXTR-CUST-LABLE00084700
084800            MOVE ' INVALID PROFILE '   TO  EXTR-VZ450-DSNAME      00084800
084900            MOVE SPACES        TO  EXTR-LOAD-DATE (1:8)           00084900
085000            MOVE EXTRACT-CNTL-REC TO FILE03-RECORD                00085000
085100            MOVE 'WRITEOUT'  TO FILE03-ENTRY                      00085100
085200            PERFORM Z020-CALL-FILE03-PGM                          00085200
085300               THRU Z020-CALL-FILE03-PGM-X                        00085300
085400          END-IF                                                  00085400
085500* END OF CHANGES - NOV RELEASE                                    00085500
085600                                                                  00085600
085700          PERFORM B124-UPDATE-CYCLE-DATE                          00085700
085800             THRU B124-UPDATE-CYCLE-DATE-X                        00085800
085900                                                                  00085900
086000          MOVE 'Y' TO REPT-IND                                    00086000
086100          MOVE REPT-CNTL-REC   TO STRIPIO-RECORD                  00086100
086200          IF STRIPIO-ERROR-CODE EQUAL ZERO                        00086200
086300              MOVE 'WRITEOUT' TO STRIPIO-ENTRY                    00086300
086400              PERFORM Z000-CALL-STRIPIO-PGM                       00086400
086500                 THRU Z000-CALL-STRIPIO-PGM-X                     00086500
086600          END-IF                                                  00086600
086700          SET     T-INX            UP BY 1                        00086700
086800          IF  WS-EXTR-CUST-LABLE IS NUMERIC                       00086800
086900          ADD 1 TO WS-R-COUNT                                     00086900
087000          END-IF                                                  00087000
087100        END-PERFORM                                               00087100
087200        ELSE                                                      00087200
087300           IF WS-RELEASE-IND = 'N' OR                             00087300
087400                  WS-CONFIG-THRES >= MAX-THRES THEN               00087400
087500              SET    T-INX        TO    1                         00087500
087600              PERFORM UNTIL                                       00087600
087700                  T-INX > WS-T-COUNT                              00087700
087800               INITIALIZE REPT-CNTL-REC                           00087800
087900               MOVE T-CUST-LB(T-INX)        TO  REPT-CUST-LABEL   00087900
088000               MOVE T-MAN(T-INX)            TO  REPT-MAN          00088000
088100               MOVE T-MAN-BILL-DATE(T-INX)  TO  REPT-MAN-BILL-DATE00088100
088200               IF WS-RELEASE-IND = 'N'                            00088200
088300                  MOVE 'N'                  TO  REPT-IND          00088300
088400               ELSE                                               00088400
088500                  MOVE 'R'                  TO  REPT-IND          00088500
088600               END-IF                                             00088600
088700               MOVE REPT-CNTL-REC  TO STRIPIO-RECORD              00088700
088800               IF STRIPIO-ERROR-CODE EQUAL ZERO                   00088800
088900                    MOVE 'WRITEOUT' TO STRIPIO-ENTRY              00088900
089000                    PERFORM Z000-CALL-STRIPIO-PGM                 00089000
089100                       THRU Z000-CALL-STRIPIO-PGM-X               00089100
089200               END-IF                                             00089200
089300               SET     T-INX            UP BY 1                   00089300
089400              END-PERFORM                                         00089400
089500           END-IF                                                 00089500
089600        END-IF.                                                   00089600
089700        SET     T-INX            TO 1.                            00089700
089800        MOVE     'N'             TO  WS-CONFIG-FOUND.             00089800
089900        MOVE     'D'             TO  WS-RELEASE-IND.              00089900
090000        INITIALIZE EXTRACT-CNTL-REC.                              00090000
090100        PERFORM UNTIL                                             00090100
090200                  T-INX > WS-T-COUNT                              00090200
090300           INITIALIZE T-DAT-LIN(T-INX)                            00090300
090400           SET     T-INX         UP BY 1                          00090400
090500        END-PERFORM.                                              00090500
090600                                                                  00090600
090700        MOVE     0               TO WS-T-COUNT.                   00090700
090800 B120-INTER-PROCESS-X.                                            00090800
090900     EXIT.                                                        00090900
091000                                                                  00091000
091100 B121-DETERMINE-FILE.                                             00091100
091200      IF WS-JUL-CYCL(1:1) = 'M'                                   00091200
091300         EVALUATE DETERMINE-FILE                                  00091300
091400             WHEN 'A'                                             00091400
091500                  MOVE 'B' TO DETERMINE-FILE                      00091500
091600             WHEN 'B'                                             00091600
091700                  MOVE 'C' TO DETERMINE-FILE                      00091700
091800             WHEN 'C'                                             00091800
091900                  MOVE 'D' TO DETERMINE-FILE                      00091900
092000             WHEN 'D'                                             00092000
092100                  MOVE 'E' TO DETERMINE-FILE                      00092100
092200             WHEN 'E'                                             00092200
092300                  MOVE 'A' TO DETERMINE-FILE                      00092300
092400         END-EVALUATE                                             00092400
092500      ELSE                                                        00092500
092600         EVALUATE DETERMINE-FILE                                  00092600
092700             WHEN 'V'                                             00092700
092800                  MOVE 'W' TO DETERMINE-FILE                      00092800
092900             WHEN 'W'                                             00092900
093000                  MOVE 'X' TO DETERMINE-FILE                      00093000
093100             WHEN 'X'                                             00093100
093200                  MOVE 'Y' TO DETERMINE-FILE                      00093200
093300             WHEN 'Y'                                             00093300
093400                  MOVE 'Z' TO DETERMINE-FILE                      00093400
093500             WHEN 'Z'                                             00093500
093600                  MOVE 'V' TO DETERMINE-FILE                      00093600
093700         END-EVALUATE                                             00093700
093800      END-IF.                                                     00093800
093900      MOVE ZEROES TO ACCT-THRES                                   00093900
094000                     WS-CONFIG-THRES.                             00094000
094100 B121-DETERMINE-FILE-X.                                           00094100
094200      EXIT.                                                       00094200
094300                                                                  00094300
094400 B122-WRITE-OUTPUT.                                               00094400
094500                                                                  00094500
094600      INITIALIZE WS-CYCLE-DATE.                                   00094600
094700                                                                  00094700
094710      IF EXTR-VZ450-DSNAME (19:8) = 'VZ450MRG'                            
094711         MOVE 'Y' TO VAMS-VIPS-IND                                        
094712         INITIALIZE XVAMS-DSNAME                                          
094713         MOVE 'VGW' TO XVAMS-DSNAME (1:3)                                 
094714         MOVE EXTR-VZ450-DSNAME (4:15) TO XVAMS-DSNAME (4:15)             
094715         MOVE 'VAMS' TO XVAMS-DSNAME (19:4)                               
094716         MOVE EXTR-VZ450-DSNAME (27:7) TO XVAMS-DSNAME (23:7)             
094717         INITIALIZE XVIPS-DSNAME                                          
094718         MOVE 'VGW' TO XVIPS-DSNAME (1:3)                                 
094719         MOVE EXTR-VZ450-DSNAME (4:15) TO XVIPS-DSNAME (4:15)             
094720         MOVE 'VIPS' TO XVIPS-DSNAME (19:4)                               
094721         MOVE EXTR-VZ450-DSNAME (27:7) TO XVIPS-DSNAME (23:7)             
094722      ELSE                                                                
094723         MOVE 'N' TO VAMS-VIPS-IND                                        
094724      END-IF                                                              
094730                                                                          
094800      EVALUATE DETERMINE-FILE                                     00094800
094900          WHEN 'A'                                                00094900
095000               MOVE SPACES TO EXTR-BAN                            00095000
095010               MOVE SPACES TO EXTR-BILL-DATE                      00095000
095100               PERFORM B500-OPEN-BAN-CURSOR                       00095100
095200               PERFORM B501-FETCH-BAN-CURSOR                      00095200
095300               IF END-OF-BAN-CSR                                  00095300
095310                  PERFORM B122A-WRITE-FILEA                               
095500               ELSE                                               00095500
095600                  MOVE 'N' TO MAN-BAN-WRITTEN                     00095600
095700                  PERFORM UNTIL END-OF-BAN-CSR                    00095700
095800                     IF WK-OSID = 'M3'                            00095800
095900                        IF EXTR-MAN = WK-BAN                      00095900
096000                           MOVE 'Y' TO MAN-BAN-WRITTEN            00096000
096100                        ELSE                                      00096100
096200                           IF MAN-BAN-WRITTEN = 'N'               00096200
096300                              MOVE EXTR-MAN TO EXTR-BAN           00096300
096400                              MOVE EXTR-MAN-BILL-DATE             00096400
096500                                TO EXTR-BILL-DATE                 00096500
096600                              ADD 1 TO ACCT-THRES                 00096600
096610                              PERFORM B122A-WRITE-FILEA                   
096900                              MOVE 'Y' TO MAN-BAN-WRITTEN         00096900
097000                           END-IF                                 00097000
097100                        END-IF                                    00097100
097200                        MOVE EXTR-MAN TO SAV-MAN                  00097200
097300                        MOVE WK-BAN TO EXTR-BAN                   00097300
097400                        MOVE WK-BAN TO EXTR-MAN                   00097400
097500                        ADD 1 TO ACCT-THRES                       00097500
097600                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00097600
097700                        PERFORM B122A-WRITE-FILEA                 00097700
097900                        MOVE SAV-MAN TO EXTR-MAN                  00097900
098000                     ELSE                                         00098000
098100                        MOVE WK-BAN TO EXTR-BAN                   00098100
098200                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00098200
098300                        ADD 1 TO ACCT-THRES                       00098300
098400                        PERFORM B122A-WRITE-FILEA                 00098400
098600                     END-IF                                       00098600
098700                     PERFORM B501-FETCH-BAN-CURSOR                00098700
098800                  END-PERFORM                                     00098800
098900               END-IF                                             00098900
099000               PERFORM B502-CLOSE-BAN-CURSOR                      00099000
099100          WHEN 'B'                                                00099100
099200               MOVE SPACES TO EXTR-BAN                            00099200
099201               MOVE SPACES TO EXTR-BILL-DATE                      00095000
099210               PERFORM B500-OPEN-BAN-CURSOR                       00099210
099220               PERFORM B501-FETCH-BAN-CURSOR                      00099220
099230               IF END-OF-BAN-CSR                                  00099230
099240                  PERFORM B122B-WRITE-FILEB                             40
099250               ELSE                                               00099250
099260                  MOVE 'N' TO MAN-BAN-WRITTEN                     00099260
099270                  PERFORM UNTIL END-OF-BAN-CSR                    00099270
099280                     IF WK-OSID = 'M3'                            00099280
099290                        IF EXTR-MAN = WK-BAN                      00099290
099291                           MOVE 'Y' TO MAN-BAN-WRITTEN            00099291
099292                        ELSE                                      00099292
099293                           IF MAN-BAN-WRITTEN = 'N'               00099293
099294                              MOVE EXTR-MAN TO EXTR-BAN           00099294
099295                              MOVE EXTR-MAN-BILL-DATE             00099295
099296                                TO EXTR-BILL-DATE                 00099296
099297                              ADD 1 TO ACCT-THRES                 00099297
099298                              PERFORM B122B-WRITE-FILEB           00099298
099300                              MOVE 'Y' TO MAN-BAN-WRITTEN         00099300
099301                           END-IF                                 00099301
099302                        END-IF                                    00099302
099303                        MOVE EXTR-MAN TO SAV-MAN                  00099303
099304                        MOVE WK-BAN TO EXTR-BAN                   00099304
099305                        MOVE WK-BAN TO EXTR-MAN                   00099305
099306                        ADD 1 TO ACCT-THRES                       00099306
099307                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00099307
099308                        PERFORM B122B-WRITE-FILEB                 00099308
099310                        MOVE SAV-MAN TO EXTR-MAN                  00099310
099311                     ELSE                                         00099311
099312                        MOVE WK-BAN TO EXTR-BAN                   00099312
099313                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00099313
099314                        ADD 1 TO ACCT-THRES                       00099314
099315                        PERFORM B122B-WRITE-FILEB                 00099315
099317                     END-IF                                       00099317
099318                     PERFORM B501-FETCH-BAN-CURSOR                00099318
099319                  END-PERFORM                                     00099319
099320               END-IF                                             00099320
099321               PERFORM B502-CLOSE-BAN-CURSOR                      00099321
100900          WHEN 'C'                                                00100900
101000               MOVE SPACES TO EXTR-BAN                            00101000
101010               MOVE SPACES TO EXTR-BILL-DATE                      00095000
101100               PERFORM B500-OPEN-BAN-CURSOR                       00101100
101200               PERFORM B501-FETCH-BAN-CURSOR                      00101200
101300               IF END-OF-BAN-CSR                                  00101300
101400                  PERFORM B122C-WRITE-FILEC                       00101400
101500               ELSE                                               00101500
101600                  MOVE 'N' TO MAN-BAN-WRITTEN                     00101600
101700                  PERFORM UNTIL END-OF-BAN-CSR                    00101700
101800                     IF WK-OSID = 'M3'                            00101800
101900                        IF EXTR-MAN = WK-BAN                      00101900
102000                           MOVE 'Y' TO MAN-BAN-WRITTEN            00102000
102100                        ELSE                                      00102100
102200                           IF MAN-BAN-WRITTEN = 'N'               00102200
102300                              MOVE EXTR-MAN TO EXTR-BAN           00102300
102400                              MOVE EXTR-MAN-BILL-DATE             00102400
102500                                TO EXTR-BILL-DATE                 00102500
102510                              ADD 1 TO ACCT-THRES                 00102510
102520                              PERFORM B122C-WRITE-FILEC           00102520
102540                              MOVE 'Y' TO MAN-BAN-WRITTEN         00102540
102550                           END-IF                                 00102550
102560                        END-IF                                    00102560
102570                        MOVE EXTR-MAN TO SAV-MAN                  00102570
102580                        MOVE WK-BAN TO EXTR-BAN                   00102580
102590                        MOVE WK-BAN TO EXTR-MAN                   00102590
102591                        ADD 1 TO ACCT-THRES                       00102591
102592                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00102592
102593                        PERFORM B122C-WRITE-FILEC                 00102593
102595                        MOVE SAV-MAN TO EXTR-MAN                  00102595
102596                     ELSE                                         00102596
102597                        MOVE WK-BAN TO EXTR-BAN                   00102597
102598                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00102598
102599                        ADD 1 TO ACCT-THRES                       00102599
102600                        PERFORM B122C-WRITE-FILEC                 00102600
102602                     END-IF                                       00102602
102603                     PERFORM B501-FETCH-BAN-CURSOR                00102603
102604                  END-PERFORM                                     00102604
102605               END-IF                                             00102605
102606               PERFORM B502-CLOSE-BAN-CURSOR                      00102606
102610          WHEN 'D'                                                00102610
102620               MOVE SPACES TO EXTR-BAN                            00102620
102621               MOVE SPACES TO EXTR-BILL-DATE                      00095000
102630               PERFORM B500-OPEN-BAN-CURSOR                       00102630
102640               PERFORM B501-FETCH-BAN-CURSOR                      00102640
102650               IF END-OF-BAN-CSR                                  00102650
102660                  PERFORM B122D-WRITE-FILED                       00102660
102670               ELSE                                               00102670
102680                  MOVE 'N' TO MAN-BAN-WRITTEN                     00102680
102690                  PERFORM UNTIL END-OF-BAN-CSR                    00102690
102691                     IF WK-OSID = 'M3'                            00102691
102692                        IF EXTR-MAN = WK-BAN                      00102692
102693                           MOVE 'Y' TO MAN-BAN-WRITTEN            00102693
102694                        ELSE                                      00102694
102695                           IF MAN-BAN-WRITTEN = 'N'               00102695
102696                              MOVE EXTR-MAN TO EXTR-BAN           00102696
102697                              MOVE EXTR-MAN-BILL-DATE             00102697
102698                                TO EXTR-BILL-DATE                 00102698
102699                              ADD 1 TO ACCT-THRES                 00102699
102700                              PERFORM B122D-WRITE-FILED           00102700
102702                              MOVE 'Y' TO MAN-BAN-WRITTEN         00102702
102703                           END-IF                                 00102703
102704                        END-IF                                    00102704
102705                        MOVE EXTR-MAN TO SAV-MAN                  00102705
102706                        MOVE WK-BAN TO EXTR-BAN                   00102706
102707                        MOVE WK-BAN TO EXTR-MAN                   00102707
102708                        ADD 1 TO ACCT-THRES                       00102708
102709                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00102709
102710                        PERFORM B122D-WRITE-FILED                 00102710
102712                        MOVE SAV-MAN TO EXTR-MAN                  00102712
102713                     ELSE                                         00102713
102714                        MOVE WK-BAN TO EXTR-BAN                   00102714
102715                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00102715
102716                        ADD 1 TO ACCT-THRES                       00102716
102717                        PERFORM B122D-WRITE-FILED                 00102717
102719                     END-IF                                       00102719
102720                     PERFORM B501-FETCH-BAN-CURSOR                00102720
102721                  END-PERFORM                                     00102721
102722               END-IF                                             00102722
102723               PERFORM B502-CLOSE-BAN-CURSOR                      00102723
104300          WHEN 'E'                                                00104300
104310               MOVE SPACES TO EXTR-BAN                            00104310
104311               MOVE SPACES TO EXTR-BILL-DATE                      00095000
104320               PERFORM B500-OPEN-BAN-CURSOR                       00104320
104330               PERFORM B501-FETCH-BAN-CURSOR                      00104330
104340               IF END-OF-BAN-CSR                                  00104340
104350                  PERFORM B122E-WRITE-FILEE                       00104350
104360               ELSE                                               00104360
104370                  MOVE 'N' TO MAN-BAN-WRITTEN                     00104370
104380                  PERFORM UNTIL END-OF-BAN-CSR                    00104380
104390                     IF WK-OSID = 'M3'                            00104390
104391                        IF EXTR-MAN = WK-BAN                      00104391
104392                           MOVE 'Y' TO MAN-BAN-WRITTEN            00104392
104393                        ELSE                                      00104393
104394                           IF MAN-BAN-WRITTEN = 'N'               00104394
104395                              MOVE EXTR-MAN TO EXTR-BAN           00104395
104396                              MOVE EXTR-MAN-BILL-DATE             00104396
104397                                TO EXTR-BILL-DATE                 00104397
104398                              ADD 1 TO ACCT-THRES                 00104398
104399                              PERFORM B122E-WRITE-FILEE           00104399
104401                              MOVE 'Y' TO MAN-BAN-WRITTEN         00104401
104402                           END-IF                                 00104402
104403                        END-IF                                    00104403
104404                        MOVE EXTR-MAN TO SAV-MAN                  00104404
104405                        MOVE WK-BAN TO EXTR-BAN                   00104405
104406                        MOVE WK-BAN TO EXTR-MAN                   00104406
104407                        ADD 1 TO ACCT-THRES                       00104407
104408                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00104408
104409                        PERFORM B122E-WRITE-FILEE                 00104409
104411                        MOVE SAV-MAN TO EXTR-MAN                  00104411
104412                     ELSE                                         00104412
104413                        MOVE WK-BAN TO EXTR-BAN                   00104413
104414                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00104414
104415                        ADD 1 TO ACCT-THRES                       00104415
104416                        PERFORM B122E-WRITE-FILEE                 00104416
104418                     END-IF                                       00104418
104419                     PERFORM B501-FETCH-BAN-CURSOR                00104419
104420                  END-PERFORM                                     00104420
104421               END-IF                                             00104421
104422               PERFORM B502-CLOSE-BAN-CURSOR                      00104422
106000          WHEN 'V'                                                00106000
106100               MOVE SPACES TO EXTR-BAN                            00106100
106110               MOVE SPACES TO EXTR-BILL-DATE                      00095000
106200               PERFORM B500-OPEN-BAN-CURSOR                       00106200
106300               PERFORM B501-FETCH-BAN-CURSOR                      00106300
106400               IF END-OF-BAN-CSR                                  00106400
106500                  PERFORM B122V-WRITE-FILEV                       00106500
106600               ELSE                                               00106600
106700                  MOVE 'N' TO MAN-BAN-WRITTEN                     00106700
106800                  PERFORM UNTIL END-OF-BAN-CSR                    00106800
106900                     IF WK-OSID = 'M3'                            00106900
107000                        IF EXTR-MAN = WK-BAN                      00107000
107100                           MOVE 'Y' TO MAN-BAN-WRITTEN            00107100
107200                        ELSE                                      00107200
107300                           IF MAN-BAN-WRITTEN = 'N'               00107300
107400                              MOVE EXTR-MAN TO EXTR-BAN           00107400
107500                              MOVE EXTR-MAN-BILL-DATE             00107500
107600                                TO EXTR-BILL-DATE                 00107600
107700                              ADD 1 TO ACCT-THRES                 00107700
107800                              PERFORM B122V-WRITE-FILEV           00107800
108000                              MOVE 'Y' TO MAN-BAN-WRITTEN         00108000
108100                           END-IF                                 00108100
108200                        END-IF                                    00108200
108300                        MOVE EXTR-MAN TO SAV-MAN                  00108300
108400                        MOVE WK-BAN TO EXTR-BAN                   00108400
108500                        MOVE WK-BAN TO EXTR-MAN                   00108500
108600                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00108600
108700                        ADD 1 TO ACCT-THRES                       00108700
108800                        PERFORM B122V-WRITE-FILEV                 00108800
109000                        MOVE SAV-MAN TO EXTR-MAN                  00109000
109100                     ELSE                                         00109100
109200                        MOVE WK-BAN TO EXTR-BAN                   00109200
109300                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00109300
109400                        ADD 1 TO ACCT-THRES                       00109400
109500                        PERFORM B122V-WRITE-FILEV                 00109500
109700                     END-IF                                       00109700
109800                     PERFORM B501-FETCH-BAN-CURSOR                00109800
109900                  END-PERFORM                                     00109900
110000               END-IF                                             00110000
110100               PERFORM B502-CLOSE-BAN-CURSOR                      00110100
110200          WHEN 'W'                                                00110200
110210               MOVE SPACES TO EXTR-BAN                            00110210
110211               MOVE SPACES TO EXTR-BILL-DATE                      00095000
110220               PERFORM B500-OPEN-BAN-CURSOR                       00110220
110230               PERFORM B501-FETCH-BAN-CURSOR                      00110230
110240               IF END-OF-BAN-CSR                                  00110240
110250                  PERFORM B122W-WRITE-FILEW                       00110250
110260               ELSE                                               00110260
110270                  MOVE 'N' TO MAN-BAN-WRITTEN                     00110270
110280                  PERFORM UNTIL END-OF-BAN-CSR                    00110280
110290                     IF WK-OSID = 'M3'                            00110290
110291                        IF EXTR-MAN = WK-BAN                      00110291
110292                           MOVE 'Y' TO MAN-BAN-WRITTEN            00110292
110293                        ELSE                                      00110293
110294                           IF MAN-BAN-WRITTEN = 'N'               00110294
110295                              MOVE EXTR-MAN TO EXTR-BAN           00110295
110296                              MOVE EXTR-MAN-BILL-DATE             00110296
110297                                TO EXTR-BILL-DATE                 00110297
110298                              ADD 1 TO ACCT-THRES                 00110298
110299                              PERFORM B122W-WRITE-FILEW           00110299
110301                              MOVE 'Y' TO MAN-BAN-WRITTEN         00110301
110302                           END-IF                                 00110302
110303                        END-IF                                    00110303
110304                        MOVE EXTR-MAN TO SAV-MAN                  00110304
110305                        MOVE WK-BAN TO EXTR-BAN                   00110305
110306                        MOVE WK-BAN TO EXTR-MAN                   00110306
110307                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00110307
110308                        ADD 1 TO ACCT-THRES                       00110308
110309                        PERFORM B122W-WRITE-FILEW                 00110309
110311                        MOVE SAV-MAN TO EXTR-MAN                  00110311
110312                     ELSE                                         00110312
110313                        MOVE WK-BAN TO EXTR-BAN                   00110313
110314                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00110314
110315                        ADD 1 TO ACCT-THRES                       00110315
110316                        PERFORM B122W-WRITE-FILEW                 00110316
110318                     END-IF                                       00110318
110319                     PERFORM B501-FETCH-BAN-CURSOR                00110319
110320                  END-PERFORM                                     00110320
110321               END-IF                                             00110321
110322               PERFORM B502-CLOSE-BAN-CURSOR                      00110322
111900          WHEN 'X'                                                00111900
112000               MOVE SPACES TO EXTR-BAN                            00112000
112010               MOVE SPACES TO EXTR-BILL-DATE                      00095000
112100               PERFORM B500-OPEN-BAN-CURSOR                       00112100
112200               PERFORM B501-FETCH-BAN-CURSOR                      00112200
112300               IF END-OF-BAN-CSR                                  00112300
112400                  PERFORM B122X-WRITE-FILEX                       00112400
112500               ELSE                                               00112500
112600                  MOVE 'N' TO MAN-BAN-WRITTEN                     00112600
112700                  PERFORM UNTIL END-OF-BAN-CSR                    00112700
112800                     IF WK-OSID = 'M3'                            00112800
112900                        IF EXTR-MAN = WK-BAN                      00112900
113000                           MOVE 'Y' TO MAN-BAN-WRITTEN            00113000
113100                        ELSE                                      00113100
113200                           IF MAN-BAN-WRITTEN = 'N'               00113200
113300                              MOVE EXTR-MAN TO EXTR-BAN           00113300
113400                              MOVE EXTR-MAN-BILL-DATE             00113400
113500                                TO EXTR-BILL-DATE                 00113500
113510                              ADD 1 TO ACCT-THRES                 00113510
113520                              PERFORM B122X-WRITE-FILEX           00113520
113540                              MOVE 'Y' TO MAN-BAN-WRITTEN         00113540
113550                           END-IF                                 00113550
113560                        END-IF                                    00113560
113570                        MOVE EXTR-MAN TO SAV-MAN                  00113570
113580                        MOVE WK-BAN TO EXTR-BAN                   00113580
113590                        MOVE WK-BAN TO EXTR-MAN                   00113590
113591                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00113591
113592                        ADD 1 TO ACCT-THRES                       00113592
113593                        PERFORM B122X-WRITE-FILEX                 00113593
113595                        MOVE SAV-MAN TO EXTR-MAN                  00113595
113596                     ELSE                                         00113596
113597                        MOVE WK-BAN TO EXTR-BAN                   00113597
113598                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00113598
113599                        ADD 1 TO ACCT-THRES                       00113599
113600                        PERFORM B122X-WRITE-FILEX                 00113600
113620                     END-IF                                       00113620
113630                     PERFORM B501-FETCH-BAN-CURSOR                00113630
113640                  END-PERFORM                                     00113640
113650               END-IF                                             00113650
113660               PERFORM B502-CLOSE-BAN-CURSOR                      00113660
113700          WHEN 'Y'                                                00113700
113800               MOVE SPACES TO EXTR-BAN                            00113800
113810               MOVE SPACES TO EXTR-BILL-DATE                      00095000
113900               PERFORM B500-OPEN-BAN-CURSOR                       00113900
114000               PERFORM B501-FETCH-BAN-CURSOR                      00114000
114100               IF END-OF-BAN-CSR                                  00114100
114200                  PERFORM B122Y-WRITE-FILEY                       00114200
114300               ELSE                                               00114300
114400                  MOVE 'N' TO MAN-BAN-WRITTEN                     00114400
114500                  PERFORM UNTIL END-OF-BAN-CSR                    00114500
114600                     IF WK-OSID = 'M3'                            00114600
114700                        IF EXTR-MAN = WK-BAN                      00114700
114800                           MOVE 'Y' TO MAN-BAN-WRITTEN            00114800
114900                        ELSE                                      00114900
115000                           IF MAN-BAN-WRITTEN = 'N'               00115000
115100                              MOVE EXTR-MAN TO EXTR-BAN           00115100
115200                              MOVE EXTR-MAN-BILL-DATE             00115200
115210                                TO EXTR-BILL-DATE                 00115210
115220                              ADD 1 TO ACCT-THRES                 00115220
115230                              PERFORM B122Y-WRITE-FILEY           00115230
115250                              MOVE 'Y' TO MAN-BAN-WRITTEN         00115250
115260                           END-IF                                 00115260
115270                        END-IF                                    00115270
115280                        MOVE EXTR-MAN TO SAV-MAN                  00115280
115290                        MOVE WK-BAN TO EXTR-BAN                   00115290
115291                        MOVE WK-BAN TO EXTR-MAN                   00115291
115292                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00115292
115293                        ADD 1 TO ACCT-THRES                       00115293
115294                        PERFORM B122Y-WRITE-FILEY                 00115294
115296                        MOVE SAV-MAN TO EXTR-MAN                  00115296
115297                     ELSE                                         00115297
115298                        MOVE WK-BAN TO EXTR-BAN                   00115298
115299                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00115299
115300                        ADD 1 TO ACCT-THRES                       00115300
115310                        PERFORM B122Y-WRITE-FILEY                 00115310
115330                     END-IF                                       00115330
115340                     PERFORM B501-FETCH-BAN-CURSOR                00115340
115350                  END-PERFORM                                     00115350
115360               END-IF                                             00115360
115370               PERFORM B502-CLOSE-BAN-CURSOR                      00115370
115400          WHEN 'Z'                                                00115400
115500               MOVE SPACES TO EXTR-BAN                            00115500
115510               MOVE SPACES TO EXTR-BILL-DATE                      00095000
115600               PERFORM B500-OPEN-BAN-CURSOR                       00115600
115700               PERFORM B501-FETCH-BAN-CURSOR                      00115700
115800               IF END-OF-BAN-CSR                                  00115800
115900                  PERFORM B122Z-WRITE-FILEZ                       00115900
116000               ELSE                                               00116000
116100                  MOVE 'N' TO MAN-BAN-WRITTEN                     00116100
116200                  PERFORM UNTIL END-OF-BAN-CSR                    00116200
116300                     IF WK-OSID = 'M3'                            00116300
116400                        IF EXTR-MAN = WK-BAN                      00116400
116500                           MOVE 'Y' TO MAN-BAN-WRITTEN            00116500
116600                        ELSE                                      00116600
116700                           IF MAN-BAN-WRITTEN = 'N'               00116700
116800                              MOVE EXTR-MAN TO EXTR-BAN           00116800
116900                              MOVE EXTR-MAN-BILL-DATE             00116900
116910                                TO EXTR-BILL-DATE                 00116910
116920                              ADD 1 TO ACCT-THRES                 00116920
116930                              PERFORM B122Z-WRITE-FILEZ           00116930
116950                              MOVE 'Y' TO MAN-BAN-WRITTEN         00116950
116960                           END-IF                                 00116960
116970                        END-IF                                    00116970
116980                        MOVE EXTR-MAN TO SAV-MAN                  00116980
116990                        MOVE WK-BAN TO EXTR-BAN                   00116990
116991                        MOVE WK-BAN TO EXTR-MAN                   00116991
116992                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00116992
116993                        ADD 1 TO ACCT-THRES                       00116993
116994                        PERFORM B122Z-WRITE-FILEZ                 00116994
116996                        MOVE SAV-MAN TO EXTR-MAN                  00116996
116997                     ELSE                                         00116997
116998                        MOVE WK-BAN TO EXTR-BAN                   00116998
116999                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00116999
117000                        ADD 1 TO ACCT-THRES                       00117000
117001                        PERFORM B122Z-WRITE-FILEZ                 00117001
117003                     END-IF                                       00117003
117004                     PERFORM B501-FETCH-BAN-CURSOR                00117004
117005                  END-PERFORM                                     00117005
117006               END-IF                                             00117006
117007               PERFORM B502-CLOSE-BAN-CURSOR                      00117007
117010      END-EVALUATE.                                               00117010
117100                                                                  00117100
117200 B122-WRITE-OUTPUT-X.                                             00117200
117300      EXIT.                                                       00117300
117400                                                                  00117400
117410 B122A-WRITE-FILEA.                                                     00
117411                                                                          
117412      IF VAMS-VIPS-IND = 'Y'                                              
117413*        MOVE XVAMS-DSNAME TO EXTR-VZ450-DSNAME                           
117414*        WRITE FD-FILELISTA-RECORD FROM EXTRACT-CNTL-REC                  
117416         MOVE XVIPS-DSNAME TO EXTR-VZ450-DSNAME                           
117417         WRITE FD-FILELISTA-RECORD FROM EXTRACT-CNTL-REC                  
117419      ELSE                                                                
117420         WRITE FD-FILELISTA-RECORD FROM EXTRACT-CNTL-REC                  
117422      END-IF.                                                             
117423                                                                          
117424 B122A-WRITE-FILEA-X.                                                   00
117430      EXIT.                                                             00
117440                                                                  00119600
117450 B122B-WRITE-FILEB.                                                     00
117460                                                                          
117470      IF VAMS-VIPS-IND = 'Y'                                              
117480*        MOVE XVAMS-DSNAME TO EXTR-VZ450-DSNAME                           
117490*        WRITE FD-FILELISTB-RECORD FROM EXTRACT-CNTL-REC                  
117491         MOVE XVIPS-DSNAME TO EXTR-VZ450-DSNAME                           
117492         WRITE FD-FILELISTB-RECORD FROM EXTRACT-CNTL-REC                  
117493      ELSE                                                                
117494         WRITE FD-FILELISTB-RECORD FROM EXTRACT-CNTL-REC                  
117495      END-IF.                                                             
117496                                                                          
117497 B122B-WRITE-FILEB-X.                                                   00
117498      EXIT.                                                             00
117499                                                                  00119600
117500 B122C-WRITE-FILEC.                                                     00
117501                                                                          
117502      IF VAMS-VIPS-IND = 'Y'                                              
117503*        MOVE XVAMS-DSNAME TO EXTR-VZ450-DSNAME                           
117504*        WRITE FD-FILELISTC-RECORD FROM EXTRACT-CNTL-REC                  
117505         MOVE XVIPS-DSNAME TO EXTR-VZ450-DSNAME                           
117506         WRITE FD-FILELISTC-RECORD FROM EXTRACT-CNTL-REC                  
117507      ELSE                                                                
117508         WRITE FD-FILELISTC-RECORD FROM EXTRACT-CNTL-REC                  
117509      END-IF.                                                             
117510                                                                          
117511 B122C-WRITE-FILEC-X.                                                   00
117512      EXIT.                                                             00
117513                                                                  00119600
117514 B122D-WRITE-FILED.                                                     00
117515                                                                          
117516      IF VAMS-VIPS-IND = 'Y'                                              
117517*        MOVE XVAMS-DSNAME TO EXTR-VZ450-DSNAME                           
117518*        WRITE FD-FILELISTD-RECORD FROM EXTRACT-CNTL-REC                  
117519         MOVE XVIPS-DSNAME TO EXTR-VZ450-DSNAME                           
117520         WRITE FD-FILELISTD-RECORD FROM EXTRACT-CNTL-REC                  
117521      ELSE                                                                
117522         WRITE FD-FILELISTD-RECORD FROM EXTRACT-CNTL-REC                  
117523      END-IF.                                                             
117524                                                                          
117525 B122D-WRITE-FILED-X.                                                   00
117526      EXIT.                                                             00
117527                                                                  00119600
117528 B122E-WRITE-FILEE.                                                     00
117529                                                                          
117530      IF VAMS-VIPS-IND = 'Y'                                              
117531*        MOVE XVAMS-DSNAME TO EXTR-VZ450-DSNAME                           
117532*        WRITE FD-FILELISTE-RECORD FROM EXTRACT-CNTL-REC                  
117533         MOVE XVIPS-DSNAME TO EXTR-VZ450-DSNAME                           
117534         WRITE FD-FILELISTE-RECORD FROM EXTRACT-CNTL-REC                  
117535      ELSE                                                                
117536         WRITE FD-FILELISTE-RECORD FROM EXTRACT-CNTL-REC                  
117537      END-IF.                                                             
117538                                                                          
117539 B122E-WRITE-FILEE-X.                                                   00
117540      EXIT.                                                             00
117541                                                                  00119600
117542 B122V-WRITE-FILEV.                                                     00
117543                                                                          
117544      IF VAMS-VIPS-IND = 'Y'                                              
117545*        MOVE XVAMS-DSNAME TO EXTR-VZ450-DSNAME                           
117546*        WRITE FD-FILELISTV-RECORD FROM EXTRACT-CNTL-REC                  
117547         MOVE XVIPS-DSNAME TO EXTR-VZ450-DSNAME                           
117548         WRITE FD-FILELISTV-RECORD FROM EXTRACT-CNTL-REC                  
117549      ELSE                                                                
117550         WRITE FD-FILELISTV-RECORD FROM EXTRACT-CNTL-REC                  
117551      END-IF.                                                             
117552                                                                          
117553 B122V-WRITE-FILEV-X.                                                   00
117554      EXIT.                                                             00
117555                                                                  00119600
117556 B122W-WRITE-FILEW.                                                     00
117557                                                                          
117558      IF VAMS-VIPS-IND = 'Y'                                              
117559*        MOVE XVAMS-DSNAME TO EXTR-VZ450-DSNAME                           
117560*        WRITE FD-FILELISTW-RECORD FROM EXTRACT-CNTL-REC                  
117561         MOVE XVIPS-DSNAME TO EXTR-VZ450-DSNAME                           
117562         WRITE FD-FILELISTW-RECORD FROM EXTRACT-CNTL-REC                  
117563      ELSE                                                                
117564         WRITE FD-FILELISTW-RECORD FROM EXTRACT-CNTL-REC                  
117565      END-IF.                                                             
117566                                                                          
117567 B122W-WRITE-FILEW-X.                                                   00
117568      EXIT.                                                             00
117569                                                                  00119600
117570 B122X-WRITE-FILEX.                                                     00
117571                                                                          
117572      IF VAMS-VIPS-IND = 'Y'                                              
117573*        MOVE XVAMS-DSNAME TO EXTR-VZ450-DSNAME                           
117574*        WRITE FD-FILELISTX-RECORD FROM EXTRACT-CNTL-REC                  
117575         MOVE XVIPS-DSNAME TO EXTR-VZ450-DSNAME                           
117576         WRITE FD-FILELISTX-RECORD FROM EXTRACT-CNTL-REC                  
117577      ELSE                                                                
117578         WRITE FD-FILELISTX-RECORD FROM EXTRACT-CNTL-REC                  
117579      END-IF.                                                             
117580                                                                          
117581 B122X-WRITE-FILEX-X.                                                   00
117582      EXIT.                                                             00
117583                                                                  00119600
117584 B122Y-WRITE-FILEY.                                                     00
117585                                                                          
117586      IF VAMS-VIPS-IND = 'Y'                                              
117587*        MOVE XVAMS-DSNAME TO EXTR-VZ450-DSNAME                           
117588*        WRITE FD-FILELISTY-RECORD FROM EXTRACT-CNTL-REC                  
117589         MOVE XVIPS-DSNAME TO EXTR-VZ450-DSNAME                           
117590         WRITE FD-FILELISTY-RECORD FROM EXTRACT-CNTL-REC                  
117591      ELSE                                                                
117592         WRITE FD-FILELISTY-RECORD FROM EXTRACT-CNTL-REC                  
117593      END-IF.                                                             
117594                                                                          
117595 B122Y-WRITE-FILEY-X.                                                   00
117596      EXIT.                                                             00
117597                                                                  00119600
117598 B122Z-WRITE-FILEZ.                                                     00
117599                                                                          
117600      IF VAMS-VIPS-IND = 'Y'                                              
117601*        MOVE XVAMS-DSNAME TO EXTR-VZ450-DSNAME                           
117602*        WRITE FD-FILELISTZ-RECORD FROM EXTRACT-CNTL-REC                  
117603         MOVE XVIPS-DSNAME TO EXTR-VZ450-DSNAME                           
117604         WRITE FD-FILELISTZ-RECORD FROM EXTRACT-CNTL-REC                  
117605      ELSE                                                                
117606         WRITE FD-FILELISTZ-RECORD FROM EXTRACT-CNTL-REC                  
117607      END-IF.                                                             
117608                                                                          
117609 B122Z-WRITE-FILEZ-X.                                                   00
117610      EXIT.                                                             00
117611                                                                  00119600
117612 B123-STORE-CONFIG-WRITTEN.                                       00117500
117620* THIS PARA STORES THE ELIGIBLE LIST OF CONFIG'S THAT IS          00117600
117700* RELEASED.THIS ARRAY IS SEARCHED FOR THE RECREATES SO THAT       00117700
117800* A CONFIG IS NOT RELEASED BOTH THRU NORMAL  & RECRATES PROCESS   00117800
117900      MOVE T-CUST-LB(T-INX) TO WS-COMP-CONFIG-1                   00117900
118000      SET CONIX TO 1.                                             00118000
118100                                                                  00118100
118200      SEARCH CONFIG-FILE-ARRAY                                    00118200
118300             AT END MOVE 'N' TO WS-CONFIG-FOUND-1                 00118300
118400        WHEN CONFIG-FILE-KEY (CONIX) = WS-COMP-CONFIG-1           00118400
118500             MOVE 'Y' TO WS-CONFIG-FOUND-1                        00118500
118600      END-SEARCH.                                                 00118600
118700                                                                  00118700
118800      SET CONIX TO SAVE-CONIX                                     00118800
118900      IF WS-CONFIG-FOUND-1 = 'N'                                  00118900
119000         MOVE WS-COMP-CONFIG-1 TO CONFIG-FILE-KEY (CONIX)         00119000
119100         SET CONIX      UP BY 1                                   00119100
119200         SET SAVE-CONIX TO CONIX                                  00119200
119300      END-IF.                                                     00119300
119400 B123-STORE-CONFIG-WRITTEN-X.                                     00119400
119500      EXIT.                                                       00119500
119510                                                                  00117400
119700 B124-UPDATE-CYCLE-DATE.                                          00119700
119800                                                                  00119800
119900      MOVE DETERMINE-FILE TO WS-CYCLE-DATE(1:1).                  00119900
120000      MOVE WS-JUL-CYCL-2  TO WS-CYCLE-DATE(2:5).                  00120000
120100      MOVE EXTR-CUST-LABEL(1:5) TO WS-CUSTOMER-ID.                00120100
120200      MOVE EXTR-CUST-LABEL(6:2) TO WS-CONFIG.                     00120200
120300                                                                  00120300
120400      EXEC SQL                                                    00120400
120500          UPDATE BM_CONFIG_PROC_T                                 00120500
120600          SET CYCLE_DATE      = :WS-CYCLE-DATE                    00120600
120700          WHERE CUSTOMER_ID   = :WS-CUSTOMER-ID                   00120700
120800            AND CONFIG_ID     = :WS-CONFIG                        00120800
120900            AND MAN_BILL_DATE = :EXTR-MAN-BILL-DATE               00120900
121000            AND ACCT_SENT_DT                                      00121000
121100                      = '9999-12-31-00.00.00.000000'              00121100
121200      END-EXEC.                                                   00121200
121300      EVALUATE SQLCODE                                            00121300
121400      WHEN ZERO                                                   00121400
121500        EXEC SQL                                                  00121500
121600             COMMIT                                               00121600
121700        END-EXEC                                                  00121700
121800        IF SQLCODE NOT EQUAL TO 0                                 00121800
121900          PERFORM U000-DISPLAY-DB2-ERROR-MSG                      00121900
122000             THRU U000-DISPLAY-DB2-ERROR-MSG-X                    00122000
122100        END-IF                                                    00122100
122200      WHEN 100                                                    00122200
122300        CONTINUE                                                  00122300
122400      WHEN OTHER                                                  00122400
122500        PERFORM U000-DISPLAY-DB2-ERROR-MSG                        00122500
122600           THRU U000-DISPLAY-DB2-ERROR-MSG-X                      00122600
122700      END-EVALUATE.                                               00122700
122800 B124-UPDATE-CYCLE-DATE-X.                                        00122800
122900      EXIT.                                                       00122900
123000                                                                  00123000
123100 B130-LOAD-TEPARR.                                                00123100
123200*     LOADING DATA FROM CURSOR INTO TEMP-ARRAY FOR A CONFIG       00123200
123300                                                                  00123300
123400     MOVE WS-PRC-CUST-LB             TO  T-CUST-LB(T-INX).        00123400
123500     MOVE BMCONPRC-MAN               TO  T-MAN(T-INX).            00123500
123600     MOVE BMCONPRC-MAN-BILL-DATE     TO  T-MAN-BILL-DATE(T-INX).  00123600
123700     MOVE BMCONPRC-ORIG-SYSTEM-ID    TO  T-ORIG-SYSTEM-ID(T-INX). 00123700
123800     MOVE BMCONPRC-VZ450-DSNAME      TO  T-VZ450-DSNAME(T-INX).   00123800
123900     MOVE BMCONPRC-VAM-LOAD-DATE     TO  T-VAM-LOAD-DATE(T-INX).  00123900
124000     MOVE BMCONPRC-LOB-IND           TO  T-LOB-IND(T-INX).        00124000
124100                                                                  00124100
124200     MOVE WS-PRC-CUST-LB               TO  WS-PRE-PRC-CUST-LB.    00124200
124300     MOVE BMCONPRC-MAN-BILL-DATE       TO  WS-PRE-PRC-MN-YR.      00124300
124400**   MOVE BMCONPRC-MAN-BILL-DATE(9:2)  TO  WS-PRE-PRC-BILL-DATE.  00124400
124500     SET T-INX                 UP BY 1.                           00124500
124600     ADD       1               TO WS-T-COUNT.                     00124600
124700     PERFORM A060-FETCH-PRC-CURSOR-1-ROW                          00124700
124800        THRU A060-FETCH-PRC-CURSOR-1-ROW-X.                       00124800
124900     MOVE BMCONPRC-CUSTOMER-ID        TO    WS-PRC-CUSTOMER-ID.   00124900
125000     MOVE BMCONPRC-CONFIG-ID          TO    WS-PRC-CONFIG-ID.     00125000
125100     MOVE BMCONPRC-MAN-BILL-DATE      TO    WS-BMCONPRC-MN-YR.    00125100
125200                                                                  00125200
125300 B130-LOAD-TEPARR-X.                                              00125300
125400     EXIT.                                                        00125400
125500     EJECT                                                        00125500
125600                                                                  00125600
125700 B140-VALIDATE-PARA.                                              00125700
125800     SET T-INX TO 1.                                              00125800
125900     SET M-INX TO 1.                                              00125900
126000     MOVE T-CUST-LB(T-INX)  TO WS-COMP-CONFIG.                    00126000
126100     SEARCH M-DAT-LIN                                             00126100
126200             AT END MOVE 'N' TO WS-CONFIG-FOUND                   00126200
126300         WHEN M-CUST-LB(M-INX) = WS-COMP-CONFIG                   00126300
126400             MOVE 'Y' TO WS-CONFIG-FOUND                          00126400
126500     END-SEARCH.                                                  00126500
126600                                                                  00126600
126700     IF WS-CONFIG-FOUND = 'Y' THEN                                00126700
126800         MOVE M-CUST-LB(M-INX) TO WS-PRE-SER-CUST-LB              00126800
126900         MOVE M-MAN(M-INX)     TO WS-PRE-SER-MAN                  00126900
127000         PERFORM B150-CHECK-MAN                                   00127000
127100            THRU B150-CHECK-MAN-X  UNTIL                          00127100
127200             (M-CUST-LB(M-INX) NOT EQUAL TO WS-PRE-SER-CUST-LB) OR00127200
127300             (WS-RELEASE-IND EQUAL TO 'N')                        00127300
127400     END-IF.                                                      00127400
127500                                                                  00127500
127600 B140-VALIDATE-PARA-X.                                            00127600
127700      EXIT.                                                       00127700
127800                                                                  00127800
127900 B150-CHECK-MAN.                                                  00127900
128000      SET T-INX TO 1.                                             00128000
128100      SEARCH T-DAT-LIN                                            00128100
128200           AT END MOVE 'N' TO WS-RELEASE-IND                      00128200
128300          WHEN T-CUST-LB(T-INX) = M-CUST-LB(M-INX) AND            00128300
128400               T-MAN(T-INX)     = M-MAN(M-INX)                    00128400
128500                MOVE 'Y' TO WS-RELEASE-IND                        00128500
128600      END-SEARCH.                                                 00128600
128700      MOVE M-MAN(M-INX)  TO WS-PRE-SER-MAN-T.                     00128700
128800                                                                  00128800
128900      SET M-INX UP BY 1.                                          00128900
129000      IF WS-RELEASE-IND = 'N' THEN                                00129000
129100         PERFORM  B160-CHECK-MAN-PART THRU  B160-CHECK-MAN-PART-X 00129100
129200      END-IF.                                                     00129200
129300 B150-CHECK-MAN-X.                                                00129300
129400      EXIT.                                                       00129400
129500                                                                  00129500
129600 B160-CHECK-MAN-PART.                                             00129600
129700     MOVE WS-PRE-PRC-MN-YR TO WS-PRE-PRC-MN-YR-T                  00129700
129800     EXEC SQL                                                     00129800
129900         SELECT MAN_PARTIAL_IND INTO                              00129900
130000                :MASTACCT-MAN-PARTIAL-IND                         00130000
130100         FROM MASTER_ACCT_NO_T                                    00130100
130200         WHERE MAN = :WS-PRE-SER-MAN-T AND                        00130200
130300               MAN_BILL_DATE = (SELECT MAX(MAN_BILL_DATE)         00130300
130400                                 FROM MASTER_ACCT_NO_T            00130400
130500                                WHERE MAN = :WS-PRE-SER-MAN-T AND 00130500
130600                                SUBSTR(CHAR(MAN_BILL_DATE),1,7)   00130600
130700                                < : WS-PRE-PRC-MN-YR-T)           00130700
130800           AND LOCATION = 'V'                                     00130800
130900     END-EXEC.                                                    00130900
131000     EVALUATE SQLCODE                                             00131000
131100     WHEN +000                                                    00131100
131200          IF MASTACCT-MAN-PARTIAL-IND = 'N'                       00131200
131300             PERFORM  B170-CHECK-ACCT-SUM                         00131300
131400                THRU  B170-CHECK-ACCT-SUM-X                       00131400
131500          END-IF                                                  00131500
131600     WHEN +100                                                    00131600
131700          MOVE 'N' TO  WS-RELEASE-IND                             00131700
131800          CONTINUE                                                00131800
131900     WHEN OTHER                                                   00131900
132000        DISPLAY '!!! ERROR FOR SELECT FROM CHECK-MAN-PART !!!'    00132000
132100        DISPLAY 'WS-PRE-SER-MAN-T=' WS-PRE-SER-MAN-T              00132100
132200        PERFORM U000-DISPLAY-DB2-ERROR-MSG                        00132200
132300           THRU U000-DISPLAY-DB2-ERROR-MSG-X                      00132300
132400     END-EVALUATE.                                                00132400
132500 B160-CHECK-MAN-PART-X.                                           00132500
132600      EXIT.                                                       00132600
132700                                                                  00132700
132800 B170-CHECK-ACCT-SUM.                                             00132800
132900     EXEC SQL                                                     00132900
133000         SELECT ACCT_STATUS_IND,                                  00133000
133100                TOT_BILL_AMT INTO                                 00133100
133200                :WS-ACCT-ST-IND,                                  00133200
133300                :WS-TOT-BILL-AMT                                  00133300
133400         FROM ACCT_SUM_T                                          00133400
133500         WHERE MAN = :WS-PRE-SER-MAN-T AND                        00133500
133600         MAN_BILL_DATE = (SELECT MAX(MAN_BILL_DATE)               00133600
133700                      FROM ACCT_SUM_T                             00133700
133800               WHERE MAN = :WS-PRE-SER-MAN-T AND                  00133800
133900      SUBSTR(CHAR(MAN_BILL_DATE),1,7) < : WS-PRE-PRC-MN-YR-T      00133900
134000                           AND                                    00134000
134100               MAN = BAN ) AND                                    00134100
134200               MAN = BAN                                          00134200
134300     END-EXEC.                                                    00134300
134400     EVALUATE SQLCODE                                             00134400
134500     WHEN 100                                                     00134500
134600          MOVE 'N' TO  WS-RELEASE-IND                             00134600
134700     CONTINUE                                                     00134700
134800**********MAN NOT IN ACCT_SUM_T ********                          00134800
134900     WHEN 0                                                       00134900
135000       IF (WS-ACCT-ST-IND EQUAL TO 4 OR 5) OR                     00135000
135100          (WS-TOT-BILL-AMT EQUAL TO ZERO) THEN                    00135100
135200          MOVE 'Y' TO  WS-RELEASE-IND                             00135200
135300       ELSE                                                       00135300
135400          MOVE 'N' TO  WS-RELEASE-IND                             00135400
135500       END-IF                                                     00135500
135600     WHEN OTHER                                                   00135600
135700        DISPLAY '!!! ERROR FOR SELECT FROM ACCT_SUM_T !!!'        00135700
135800        DISPLAY 'WS-PRE-SER-MAN-T=' WS-PRE-SER-MAN-T              00135800
135900        PERFORM U000-DISPLAY-DB2-ERROR-MSG                        00135900
136000           THRU U000-DISPLAY-DB2-ERROR-MSG-X                      00136000
136100     END-EVALUATE.                                                00136100
136200                                                                  00136200
136300 B170-CHECK-ACCT-SUM-X.                                           00136300
136400      EXIT.                                                       00136400
136500                                                                  00136500
136600***CODE ADDED TO CHECK WHETHER ALL THE FILES ARE ALLOCATED***     00136600
136700 B180-CHECK-ALLOC.                                                00136700
136800       IF WS-RELEASE-IND = 'Y'                                    00136800
136900         SET    T-INX        TO    1                              00136900
137000         PERFORM UNTIL                                            00137000
137100                  T-INX > WS-T-COUNT                              00137100
137200           MOVE T-VZ450-DSNAME(T-INX) TO FILE02-DSNAME            00137200
137300           MOVE 5                         TO ALLOFILE-NUM-PARMS   00137300
137400           MOVE 'DDNAME=FILE02'           TO ALLOFILE-PARM (1)    00137400
137500           MOVE 'DSNAME='                 TO ALLOFILE-PARM (2)    00137500
137600           MOVE FILE02-DSNAME     TO ALLOFILE-PARM (2)(8:44)      00137600
137700           MOVE 'DISP=SHR'                TO ALLOFILE-PARM (3)    00137700
137800           MOVE 'FREE=CLOSE'              TO ALLOFILE-PARM (4)    00137800
137900           MOVE 'BUFLEN=32760'           TO ALLOFILE-PARM (5)     00137900
138000           CALL ALLOFILE-PGM USING ALLOFILE-PARMS                 00138000
138100           IF ALLOFILE-ERROR-CODE = 0                             00138100
138200              CONTINUE                                            00138200
138300           ELSE                                                   00138300
138400              MOVE 'N' TO WS-RELEASE-IND                          00138400
138500           END-IF                                                 00138500
138600           MOVE 'FILE02' TO DEALLOC-DDNAME                        00138600
138700           CALL DEALLOC-PGM USING DEALLOC-DDNAME                  00138700
138800          SET     T-INX            UP BY 1                        00138800
138900         END-PERFORM                                              00138900
139000         IF WS-RELEASE-IND = 'N'                                  00139000
139100           SET    T-INX        TO    1                            00139100
139200           PERFORM UNTIL                                          00139200
139300                  T-INX > WS-T-COUNT                              00139300
139400                                                                  00139400
139500              INITIALIZE REPT-CNTL-REC                            00139500
139600              MOVE T-CUST-LB(T-INX)        TO  EXTR-CUST-LABEL    00139600
139700              MOVE T-MAN(T-INX)            TO  EXTR-MAN           00139700
139800              MOVE T-VZ450-DSNAME(T-INX)   TO  EXTR-VZ450-DSNAME  00139800
139900              MOVE T-MAN-BILL-DATE(T-INX)  TO  EXTR-MAN-BILL-DATE 00139900
140000              MOVE EXTRACT-CNTL-REC TO FILE03-RECORD              00140000
140100              MOVE 'WRITEOUT'  TO FILE03-ENTRY                    00140100
140200              PERFORM Z020-CALL-FILE03-PGM                        00140200
140300                 THRU Z020-CALL-FILE03-PGM-X                      00140300
140400          SET     T-INX            UP BY 1                        00140400
140500            END-PERFORM                                           00140500
140600         END-IF                                                   00140600
140700       END-IF.                                                    00140700
140800 B180-CHECK-ALLOC-X.                                              00140800
140900      EXIT.                                                       00140900
141000                                                                  00141000
141100 B190-FIND-FILEID.                                                00141100
141200      IF WS-FILEID-IND = 'R'                                      00141200
141300         MOVE EXTR-CUST-LABEL(1:5) TO WS-NATL-CUSTOMER-ID         00141300
141400         MOVE EXTR-CUST-LABEL(6:2) TO WS-NATL-CONFIG-ID           00141400
141500      ELSE                                                        00141500
141600         MOVE T-CUST-LB(T-INX)     TO WS-NATL-KEY                 00141600
141700         MOVE T-ORIG-SYSTEM-ID (T-INX) TO WS-ORIG-SYSTEM-ID       00141700
141800      END-IF                                                      00141800
141900                                                                  00141900
142000      SET NATLIX TO 1                                             00142000
142100      SEARCH BMGBM3C-NATL-ARRAY                                   00142100
142200              AT END MOVE 'N' TO WS-NATL-IND                      00142200
142300        WHEN BMGBM3C-NATL-KEY (NATLIX) = WS-NATL-KEY              00142300
142400                  MOVE 'Y'   TO WS-NATL-IND                       00142400
142500      END-SEARCH                                                  00142500
142600      MOVE SPACES TO WS-SORT-FILEID                               00142600
142700      IF WS-NATL-IND  = 'Y'                                       00142700
142710         IF WS-ORIG-SYSTEM-ID = 'M1' OR                                   
142720            WS-ORIG-SYSTEM-ID = 'M2'                                      
142800               MOVE 'BMGRM1M2' TO WS-SORT-FILEID                        00
142810         ELSE                                                             
142811               MOVE 'BMGRNATL' TO WS-SORT-FILEID                        00
142820         END-IF                                                           
142900      ELSE                                                        00142900
143000         EVALUATE WS-ORIG-SYSTEM-ID                               00143000
143100              WHEN '01'                                           00143100
143200                    PERFORM B200-EVAL-DSNAME                      00143200
143300                       THRU B200-EVAL-DSNAME-X                    00143300
143400              WHEN '05' MOVE 'BMGRNEVZ'  TO WS-SORT-FILEID        00143400
143500              WHEN '06' MOVE 'BMGRNEVZ'  TO WS-SORT-FILEID        00143500
143600              WHEN '07' MOVE 'BMGRSSBL'  TO WS-SORT-FILEID        00143600
143700              WHEN '03' MOVE 'BMGRGTEL'  TO WS-SORT-FILEID        00143700
143800              WHEN '16' MOVE 'BMGRNEVZ'  TO WS-SORT-FILEID        00143800
143900*****         WHEN '16' MOVE 'BMGRGTE '  TO WS-SORT-FILEID        00143900
144000              WHEN '04' MOVE 'BMGRBATL'  TO WS-SORT-FILEID        00144000
144100              WHEN '11' MOVE 'BMGRNSBL'  TO WS-SORT-FILEID        00144100
144200              WHEN '13' MOVE 'BMGRBATL'  TO WS-SORT-FILEID        00144200
144300              WHEN '14' MOVE 'BMGRBATL'  TO WS-SORT-FILEID        00144300
144400              WHEN '15' MOVE 'BMGRBATL'  TO WS-SORT-FILEID        00144400
144500              WHEN '22' MOVE 'BMGRETAD'  TO WS-SORT-FILEID        00144500
144600              WHEN '23' MOVE 'BMGRBATL'  TO WS-SORT-FILEID        00144600
144700              WHEN '18' MOVE 'BMGRARBR'  TO WS-SORT-FILEID        00144700
144800              WHEN 'M3' MOVE 'BMGRIXPL'  TO WS-SORT-FILEID        00144800
144900              WHEN 'M1' MOVE 'BMGRM1M2'  TO WS-SORT-FILEID        00144900
145000              WHEN 'M2' MOVE 'BMGRM1M2'  TO WS-SORT-FILEID        00145000
145010              WHEN 'MH' MOVE 'BMGRGTEL'  TO WS-SORT-FILEID                
145100              WHEN OTHER MOVE 'BMGROTHR'  TO WS-SORT-FILEID       00145100
145200         END-EVALUATE                                             00145200
145300      END-IF.                                                     00145300
145400                                                                  00145400
145500      IF WS-SORT-FILEID EQUAL SPACES OR                           00145500
145600         WS-SORT-FILEID EQUAL LOW-VALUES                          00145600
145700         MOVE 'BMGRBATL' TO WS-SORT-FILEID                        00145700
145800      END-IF.                                                     00145800
145900 B190-FIND-FILEID-X.                                              00145900
146000      EXIT.                                                       00146000
146100                                                                  00146100
146200 B200-EVAL-DSNAME.                                                00146200
146300                                                                  00146300
146400      IF EXTR-VZ450-DSNAME (10:4) = 'NEVZ'                        00146400
146500         MOVE 'BMGRNEVZ'  TO WS-SORT-FILEID                       00146500
146600      ELSE                                                        00146600
146700         IF EXTR-VZ450-DSNAME (10:4) = 'NYVZ'                     00146700
146800            MOVE 'BMGRNYVZ'  TO WS-SORT-FILEID                    00146800
146900         ELSE                                                     00146900
147000            IF EXTR-VZ450-DSNAME (10:4) = 'VZEC'                  00147000
147100               PERFORM B210-EVAL-BILL-SYS-ID                      00147100
147200                  THRU B210-EVAL-BILL-SYS-ID-X                    00147200
147300            END-IF                                                00147300
147400         END-IF                                                   00147400
147500      END-IF.                                                     00147500
147600 B200-EVAL-DSNAME-X.                                              00147600
147700      EXIT.                                                       00147700
147800                                                                  00147800
147900 B210-EVAL-BILL-SYS-ID.                                           00147900
148000      EXEC SQL                                                    00148000
148100          SELECT BILL_SYSTEM_ID                                   00148100
148200            INTO :WS-BILL-SYS-ID                                  00148200
148300            FROM MASTER_ACCT_NO_T                                 00148300
148400           WHERE MAN             = :EXTR-MAN                      00148400
148500             AND MAN_BILL_DATE   = :EXTR-MAN-BILL-DATE            00148500
148600             AND ORIG_SYSTEM_ID  = :WS-ORIG-SYSTEM-ID             00148600
148700             AND MAN_PARTIAL_IND = 'N'                            00148700
148800             AND LOCATION        = 'V'                            00148800
148900      END-EXEC.                                                   00148900
149000                                                                  00149000
149100      EVALUATE SQLCODE                                            00149100
149200             WHEN 000                                             00149200
149300                  IF WS-BILL-SYS-ID = '1'                         00149300
149400                     MOVE 'BMGRNYVZ'  TO WS-SORT-FILEID           00149400
149500                  ELSE                                            00149500
149600                      IF WS-BILL-SYS-ID = '2'                     00149600
149700                         MOVE 'BMGRNEVZ'  TO WS-SORT-FILEID       00149700
149800                      END-IF                                      00149800
149900                  END-IF                                          00149900
150000             WHEN OTHER                                           00150000
150100                  DISPLAY 'ERROR B210-EVAL-BILL-SYS-ID'           00150100
150200                  PERFORM U000-DISPLAY-DB2-ERROR-MSG              00150200
150300                     THRU U000-DISPLAY-DB2-ERROR-MSG-X            00150300
150400      END-EVALUATE.                                               00150400
150500 B210-EVAL-BILL-SYS-ID-X.                                         00150500
150600      EXIT.                                                       00150600
150700                                                                  00150700
150800 B300-ADD-RECREATE-CONFIG.                                        00150800
150900      EXEC SQL                                                    00150900
151000          OPEN RECREATE_CUR                                       00151000
151100      END-EXEC.                                                   00151100
151200      EVALUATE SQLCODE                                            00151200
151300          WHEN +000                                               00151300
151400            MOVE 'Y' TO FIRST-TIME                                00151400
151500            MOVE 'Y' TO FIRST-TIME-FETCH                          00151500
151600            MOVE ZEROES TO MAX-RECRIX                             00151600
151700            SET RECRIX TO  1                                      00151700
151800            PERFORM B310-FETCH-REC-CURSOR                         00151800
151900               THRU B310-FETCH-REC-CURSOR-X                       00151900
152000                               UNTIL WS-RECR-CUR = 'Y'            00152000
152100          WHEN OTHER                                              00152100
152200             DISPLAY '!!! ERROR OPEN RECREATE_CUR !!!'            00152200
152300             PERFORM U000-DISPLAY-DB2-ERROR-MSG                   00152300
152400                THRU U000-DISPLAY-DB2-ERROR-MSG-X                 00152400
152500      END-EVALUATE.                                               00152500
152600      EXEC SQL                                                    00152600
152700          CLOSE RECREATE_CUR                                      00152700
152800      END-EXEC.                                                   00152800
152900 B300-ADD-RECREATE-CONFIG-X.                                      00152900
153000      EXIT.                                                       00153000
153100                                                                  00153100
153200 B310-FETCH-REC-CURSOR.                                           00153200
153300     IF FIRST-TIME-FETCH = 'Y'                                    00153300
153400     EXEC SQL                                                     00153400
153500        FETCH RECREATE_CUR INTO    :BMCONREC-CUSTOMER-ID,         00153500
153600                              :BMCONREC-CONFIG-ID,                00153600
153700                              :BMCONREC-MAN,                      00153700
153800                              :BMCONREC-MAN-BILL-DATE,            00153800
153900                              :BMCONREC-VZ450-DSNAME,             00153900
154000                              :BMCONREC-RECREATE-COUNT,           00154000
154100                              :BMCONREC-ORIG-SYSTEM-ID            00154100
154200     END-EXEC                                                     00154200
154300     END-IF                                                       00154300
154400      MOVE 'Y' TO FIRST-TIME-FETCH                                00154400
154500      EVALUATE SQLCODE                                            00154500
154600          WHEN +000                                               00154600
154700            MOVE BMCONREC-CUSTOMER-ID TO CURR-CUSTOMER-ID(1:5)    00154700
154800            MOVE BMCONREC-CONFIG-ID   TO CURR-CUSTOMER-ID(6:2)    00154800
154900            MOVE BMCONREC-MAN-BILL-DATE(1:7) TO CURR-BILL         00154900
155000            IF FIRST-TIME = 'Y'                                   00155000
155100               MOVE 'N' TO FIRST-TIME                             00155100
155200               MOVE CURR-CUSTOMER-ID TO PREV-CUSTOMER-ID          00155200
155300               MOVE CURR-BILL        TO PREV-BILL                 00155300
155400            END-IF                                                00155400
155500                                                                  00155500
155600            IF CURR-CUSTOMER-ID = PREV-CUSTOMER-ID AND            00155600
155700               CURR-BILL        = PREV-BILL                       00155700
155800               MOVE BMCONREC-CUSTOMER-ID TO                       00155800
155900                           BMGBM3C-RECR-CUSTOMER-ID (RECRIX)      00155900
156000               MOVE BMCONREC-CONFIG-ID TO BMGBM3C-RECR-CONFIG-ID  00156000
156100                                                  (RECRIX)        00156100
156200               MOVE BMCONREC-VZ450-DSNAME TO BMGBM3C-RECR-DSNAME  00156200
156300                                                  (RECRIX)        00156300
156400               MOVE BMCONREC-MAN          TO BMGBM3C-RECR-MAN     00156400
156500                                                  (RECRIX)        00156500
156600              MOVE BMCONREC-MAN-BILL-DATE TO BMGBM3C-RECR-MAN-BILL00156600
156700                                                  (RECRIX)        00156700
156800              MOVE BMCONREC-RECREATE-COUNT TO BMGBM3C-RECR-COUNT  00156800
156900                                                  (RECRIX)        00156900
157000              MOVE BMCONREC-ORIG-SYSTEM-ID TO BMGBM3C-RECR-ORIG   00157000
157100                                                  (RECRIX)        00157100
157200                SET RECRIX UP BY 1                                00157200
157300                SET MAX-RECRIX TO RECRIX                          00157300
157400            ELSE                                                  00157400
157500               PERFORM B320-EVALUATE-CONFIG                       00157500
157600                  THRU B320-EVALUATE-CONFIG-X                     00157600
157700            END-IF                                                00157700
157800          WHEN +100                                               00157800
157900            MOVE 'Y' TO WS-RECR-CUR                               00157900
158000            PERFORM B320-EVALUATE-CONFIG                          00158000
158100               THRU B320-EVALUATE-CONFIG-X                        00158100
158200          WHEN OTHER                                              00158200
158300             DISPLAY '!!! ERROR OPEN RECREATE_CUR !!!'            00158300
158400             PERFORM U000-DISPLAY-DB2-ERROR-MSG                   00158400
158500                THRU U000-DISPLAY-DB2-ERROR-MSG-X                 00158500
158600      END-EVALUATE.                                               00158600
158700 B310-FETCH-REC-CURSOR-X.                                         00158700
158800      EXIT.                                                       00158800
158900                                                                  00158900
159000 B320-EVALUATE-CONFIG.                                            00159000
159100*     DISPLAY 'IN B320-EVALUATE-CONFIG'                           00159100
159200       IF MAX-RECRIX > 1                                          00159200
159254                                                                          
159300               MOVE 'N' TO FIRST-TIME-FETCH                       00159300
159400               MOVE 'Y' TO FIRST-TIME                             00159400
159500               MOVE 'N' TO ALLOC-FAILED                           00159500
159510*    COUNT THE NUMBER OF ACCTS FOR THIS CONFIG STILL WITH                 
159520*    A RECREATE_FLAG OF 'I'                                               
159530               PERFORM B321-COUNT-IN-PROGRESS                             
159540                  THRU B321-COUNT-IN-PROGRESS-X                           
159600               SET RECRIX TO 1                                            
159700               PERFORM VARYING RECRIX FROM RECRIX BY 1                    
159800                 UNTIL RECRIX = MAX-RECRIX OR                             
159900                       ALLOC-FAILED = 'Y'                                 
160000               MOVE BMGBM3C-RECR-DSNAME (RECRIX) TO FILE01-DSNAME         
160100               MOVE 5                       TO ALLOFILE-NUM-PARMS         
160200               MOVE 'DDNAME=FILE01'         TO ALLOFILE-PARM (1)          
160300               MOVE 'DSNAME='               TO ALLOFILE-PARM (2)          
160400               MOVE FILE01-DSNAME     TO ALLOFILE-PARM (2)(8:44)          
160500               MOVE 'DISP=SHR'              TO ALLOFILE-PARM (3)          
160600               MOVE 'FREE=CLOSE'            TO ALLOFILE-PARM (4)          
160700               MOVE 'BUFLEN=32760'          TO ALLOFILE-PARM (5)          
160800               CALL ALLOFILE-PGM USING ALLOFILE-PARMS                     
160900               IF ALLOFILE-ERROR-CODE = 0                                 
161000                  CONTINUE                                                
161100               ELSE                                                       
161200                  MOVE 'Y' TO ALLOC-FAILED                                
161300               END-IF                                                     
161400               MOVE 'FILE01' TO DEALLOC-DDNAME                            
161500               CALL DEALLOC-PGM USING DEALLOC-DDNAME                      
161600               END-PERFORM                                                
161610                                                                          
161700               IF ALLOC-FAILED = 'N' AND                                00
161710                  WS-INPROGRESS-COUNT = 0                                 
161800                  PERFORM B330-WRITE-FILELIST                     00161800
161900                     THRU B330-WRITE-FILELIST-X                   00161900
162000                  SET RECRIX TO  1                                00162000
162100                  PERFORM UNTIL                                   00162100
162200                         RECRIX > 20000                           00162200
162300                     INITIALIZE BMGBM3C-RECR-ARRAY (RECRIX)       00162300
162400                     SET     RECRIX        UP BY 1                00162400
162500                  END-PERFORM                                     00162500
162600               END-IF                                             00162600
162700               MOVE PREV-CUSTOMER-ID TO PREV-2-CUSTOMER-ID        00162700
162800               MOVE PREV-BILL        TO PREV-2-BILL               00162800
162900               MOVE CURR-CUSTOMER-ID TO PREV-CUSTOMER-ID          00162900
163000               MOVE CURR-BILL        TO PREV-BILL                 00163000
163100               SET RECRIX TO  1                                   00163100
163200       END-IF.                                                    00163200
163300 B320-EVALUATE-CONFIG-X.                                          00163300
163400      EXIT.                                                       00163400
163500                                                                  00163500
163510 B321-COUNT-IN-PROGRESS.                                                  
163520******************************************************************        
163530*COUNT ACCTS STILL IN PROGRESS FOR THIS CONFIG                   *        
163540******************************************************************        
163550      MOVE 0 TO WS-INPROGRESS-COUNT.                                      
163560*     DISPLAY 'IN B231-COUNT-IN-PROGRESS'                                 
163562      MOVE BMGBM3C-RECR-CUSTOMER-ID (1) TO WS-RECR-CUSTOMER-ID          00
163564      MOVE BMGBM3C-RECR-CONFIG-ID (1)   TO WS-RECR-CONFIG-ID            00
163572      MOVE BMGBM3C-RECR-MAN-BILL (1)    TO WS-RECR-BILL-DATE            00
163582                                                                        00
163583      EXEC SQL                                                            
163584          SELECT COUNT(*)                                                 
163590              INTO :WS-INPROGRESS-COUNT                                   
163591          FROM BM_CONFIG_RECR_T                                           
163594          WHERE RECREATE_STAT_FLAG = 'I'                                  
163595            AND CUSTOMER_ID       = :WS-RECR-CUSTOMER-ID                  
163596            AND CONFIG_ID         = :WS-RECR-CONFIG-ID                    
163597            AND MAN_BILL_DATE     = :WS-RECR-BILL-DATE                    
163603      END-EXEC                                                            
163604                                                                          
163605       EVALUATE SQLCODE                                                   
163606       WHEN ZERO                                                          
163607         CONTINUE                                                         
163608       WHEN 100                                                           
163609         MOVE 0 TO WS-INPROGRESS-COUNT                                    
163610       WHEN OTHER                                                         
163611         DISPLAY ' ERROR COUNTING INPROGRESS ACCTS '                      
163612         PERFORM U000-DISPLAY-DB2-ERROR-MSG                               
163613            THRU U000-DISPLAY-DB2-ERROR-MSG-X                             
163618       END-EVALUATE.                                                      
163621                                                                          
163622 B321-COUNT-IN-PROGRESS-X.                                                
163623      EXIT.                                                               
163624                                                                          
163630 B330-WRITE-FILELIST.                                             00163600
163700       PERFORM B334-DETERMINE-RECR-MOVE                           00163700
163800          THRU B334-DETERMINE-RECR-MOVE-X                         00163800
163900       IF MAX-RECRIX > 1                                          00163900
164000          SET RECRIX TO 1                                         00164000
164100          PERFORM VARYING RECRIX FROM RECRIX BY 1                 00164100
164200                 UNTIL RECRIX = MAX-RECRIX                        00164200
164300                                                                  00164300
164400          MOVE BMGBM3C-RECR-CUSTOMER-ID (RECRIX)  TO              00164400
164500                      WS-COMP-CONFIG-1 (1:5)                      00164500
164600          MOVE BMGBM3C-RECR-CONFIG-ID   (RECRIX)  TO              00164600
164700                      WS-COMP-CONFIG-1 (6:2)                      00164700
164800          SET CONIX TO 1                                          00164800
164900          SEARCH CONFIG-FILE-ARRAY                                00164900
165000                 AT END MOVE 'N' TO WS-CONFIG-FOUND-1             00165000
165100            WHEN CONFIG-FILE-KEY (CONIX) = WS-COMP-CONFIG-1       00165100
165200            MOVE 'Y' TO WS-CONFIG-FOUND-1                         00165200
165300          END-SEARCH                                              00165300
165400          IF WS-CONFIG-FOUND-1 = 'N'                              00165400
165500          MOVE BMGBM3C-RECR-CUSTOMER-ID (RECRIX)  TO              00165500
165600                      EXTR-CUST-LABEL(1:5)                        00165600
165700          MOVE BMGBM3C-RECR-CONFIG-ID   (RECRIX)  TO              00165700
165800                      EXTR-CUST-LABEL(6:2)                        00165800
165900          MOVE BMGBM3C-RECR-DSNAME      (RECRIX)  TO              00165900
166000                      EXTR-VZ450-DSNAME                           00166000
166100          MOVE BMGBM3C-RECR-MAN-BILL    (RECRIX)  TO              00166100
166200                      EXTR-MAN-BILL-DATE                          00166200
166300          MOVE BMGBM3C-RECR-MAN         (RECRIX)  TO              00166300
166400                      EXTR-MAN                                    00166400
166500          MOVE BMGBM3C-RECR-COUNT       (RECRIX)  TO              00166500
166600                      WS-EXTR-FB-TRIGGER-COUNT                    00166600
166700          MOVE WS-EXTR-FB-TRIGGER-COUNT (9:1)     TO              00166700
166800                        EXTR-FB-TRIGGER-COUNT(2:1)                00166800
166900          MOVE BMGBM3C-RECR-ORIG        (RECRIX)  TO              00166900
167000                      WS-ORIG-SYSTEM-ID                           00167000
167100          MOVE 1            TO  EXTR-FB-TRIGGER-COUNT(1:1)        00167100
167200          MOVE 'R' TO WS-FILEID-IND                               00167200
167300          PERFORM B190-FIND-FILEID                                00167300
167400             THRU B190-FIND-FILEID-X                              00167400
167420          IF WS-SORT-FILEID = 'BMGRM1M2'                                  
167440            MOVE 'BMGRNATL' TO WS-SORT-FILEID                             
167450          END-IF                                                          
167500          MOVE WS-SORT-FILEID          TO  EXTR-LOAD-DATE         00167500
167600            IF SPLIT-RECR = 'Y'                                   00167600
167700              PERFORM B335-WRITE-UFILELIS                         00167700
167800                 THRU B335-WRITE-UFILELIS-X                       00167800
167900            ELSE                                                  00167900
167910               IF EXTR-VZ450-DSNAME (19:8) = 'VZ450MRG'                   
167920                  MOVE 'Y' TO VAMS-VIPS-IND                               
167930                  INITIALIZE XVAMS-DSNAME                                 
167940                  MOVE 'VGW' TO XVAMS-DSNAME (1:3)                        
167950                  MOVE EXTR-VZ450-DSNAME (4:15)                           
167951                    TO XVAMS-DSNAME (4:15)                                
167960                  MOVE 'VAMS' TO XVAMS-DSNAME (19:4)                      
167970                  MOVE EXTR-VZ450-DSNAME (27:7)                           
167971                    TO XVAMS-DSNAME (23:7)                                
167980                  INITIALIZE XVIPS-DSNAME                                 
167990                  MOVE 'VGW' TO XVIPS-DSNAME (1:3)                        
167991                  MOVE EXTR-VZ450-DSNAME (4:15)                           
167992                    TO XVIPS-DSNAME (4:15)                                
167993                  MOVE 'VIPS' TO XVIPS-DSNAME (19:4)                      
167994                  MOVE EXTR-VZ450-DSNAME (27:7)                           
167995                    TO XVIPS-DSNAME (23:7)                                
167996               ELSE                                                       
167997                  MOVE 'N' TO VAMS-VIPS-IND                               
167998               END-IF                                                     
168000              IF WS-JUL-CYCL(1:1) = 'M'                           00168000
168100                MOVE SPACES TO EXTR-BAN                           00168100
168110                MOVE SPACES TO EXTR-BILL-DATE                     00095000
168200                PERFORM B500-OPEN-BAN-CURSOR                      00168200
168300                PERFORM B501-FETCH-BAN-CURSOR                     00168300
168400                IF END-OF-BAN-CSR                                 00168400
168410                   PERFORM B122A-WRITE-FILEA                              
168600                ELSE                                              00168600
168700                   MOVE 'N' TO MAN-BAN-WRITTEN                    00168700
168800                   PERFORM UNTIL END-OF-BAN-CSR                   00168800
168900                      IF WK-OSID = 'M3'                           00168900
169000                         IF EXTR-MAN = WK-BAN                     00169000
169100                            MOVE 'Y' TO MAN-BAN-WRITTEN           00169100
169200                         ELSE                                     00169200
169300                            IF MAN-BAN-WRITTEN = 'N'              00169300
169400                               MOVE EXTR-MAN TO EXTR-BAN          00169400
169500                               MOVE EXTR-MAN-BILL-DATE            00169500
169600                                 TO EXTR-BILL-DATE                00169600
169700                               PERFORM B122A-WRITE-FILEA          00169700
169900                               MOVE 'Y' TO MAN-BAN-WRITTEN        00169900
170000                            END-IF                                00170000
170100                         END-IF                                   00170100
170200                         MOVE EXTR-MAN TO SAV-MAN                 00170200
170300                         MOVE WK-BAN TO EXTR-BAN                  00170300
170400                         MOVE WK-BAN TO EXTR-MAN                  00170400
170500                         MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE00170500
170600                         PERFORM B122A-WRITE-FILEA                00170600
170800                         MOVE SAV-MAN TO EXTR-MAN                 00170800
170900                      ELSE                                        00170900
171000                         MOVE WK-BAN TO EXTR-BAN                  00171000
171100                         MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE00171100
171200                         PERFORM B122A-WRITE-FILEA                00171200
171400                      END-IF                                      00171400
171500                      PERFORM B501-FETCH-BAN-CURSOR               00171500
171600                   END-PERFORM                                    00171600
171700                END-IF                                            00171700
171800                PERFORM B502-CLOSE-BAN-CURSOR                     00171800
171900              ELSE                                                00171900
172000                MOVE SPACES TO EXTR-BAN                           00172000
172010                MOVE SPACES TO EXTR-BILL-DATE                     00095000
172100                PERFORM B500-OPEN-BAN-CURSOR                      00172100
172200                PERFORM B501-FETCH-BAN-CURSOR                     00172200
172300                IF END-OF-BAN-CSR                                 00172300
172400                   PERFORM B122V-WRITE-FILEV                      00172400
172500                ELSE                                              00172500
172600                   MOVE 'N' TO MAN-BAN-WRITTEN                    00172600
172700                   PERFORM UNTIL END-OF-BAN-CSR                   00172700
172800                      IF WK-OSID = 'M3'                           00172800
172900                         IF EXTR-MAN = WK-BAN                     00172900
173000                            MOVE 'Y' TO MAN-BAN-WRITTEN           00173000
173100                         ELSE                                     00173100
173200                            IF MAN-BAN-WRITTEN = 'N'              00173200
173300                               MOVE EXTR-MAN TO EXTR-BAN          00173300
173400                               MOVE EXTR-MAN-BILL-DATE            00173400
173500                                 TO EXTR-BILL-DATE                00173500
173600                               PERFORM B122V-WRITE-FILEV          00173600
173800                               MOVE 'Y' TO MAN-BAN-WRITTEN        00173800
173900                            END-IF                                00173900
174000                         END-IF                                   00174000
174100                         MOVE EXTR-MAN TO SAV-MAN                 00174100
174200                         MOVE WK-BAN TO EXTR-BAN                  00174200
174300                         MOVE WK-BAN TO EXTR-MAN                  00174300
174400                         MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE00174400
174500                         PERFORM B122V-WRITE-FILEV                00174500
174700                         MOVE SAV-MAN TO EXTR-MAN                 00174700
174800                      ELSE                                        00174800
174900                         MOVE WK-BAN TO EXTR-BAN                  00174900
175000                         MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE00175000
175100                         PERFORM B122V-WRITE-FILEV                00175100
175300                      END-IF                                      00175300
175400                      PERFORM B501-FETCH-BAN-CURSOR               00175400
175500                   END-PERFORM                                    00175500
175600                END-IF                                            00175600
175700                PERFORM B502-CLOSE-BAN-CURSOR                     00175700
175800                WRITE  FD-FILELISTV-RECORD FROM EXTRACT-CNTL-REC  00175800
175900              END-IF                                              00175900
176000            END-IF                                                00176000
176100          END-IF                                                  00176100
176200          END-PERFORM.                                            00176200
176300 B330-WRITE-FILELIST-X.                                           00176300
176400      EXIT.                                                       00176400
176500 B334-DETERMINE-RECR-MOVE.                                        00176500
176600     IF PREV-CUSTOMER-ID = PREV-2-CUSTOMER-ID                     00176600
176700       EVALUATE TRUE                                              00176700
176800        WHEN RECR-MOVE-IND = ' ' AND DETERMINE-FILE = 'A'         00176800
176900          MOVE 'A' TO RECR-MOVE-IND                               00176900
177000        WHEN RECR-MOVE-IND = 'A'                                  00177000
177100          MOVE 'B' TO RECR-MOVE-IND                               00177100
177200        WHEN RECR-MOVE-IND = 'B'                                  00177200
177300          MOVE 'C' TO RECR-MOVE-IND                               00177300
177400        WHEN RECR-MOVE-IND = 'C'                                  00177400
177500          MOVE 'D' TO RECR-MOVE-IND                               00177500
177600        WHEN RECR-MOVE-IND = 'D'                                  00177600
177700          MOVE 'E' TO RECR-MOVE-IND                               00177700
177800        WHEN RECR-MOVE-IND = 'E'                                  00177800
177900          MOVE 'A' TO RECR-MOVE-IND                               00177900
178000        WHEN RECR-MOVE-IND = ' ' AND DETERMINE-FILE = 'V'         00178000
178100          MOVE 'V' TO RECR-MOVE-IND                               00178100
178200        WHEN RECR-MOVE-IND = 'V'                                  00178200
178300          MOVE 'W' TO RECR-MOVE-IND                               00178300
178400        WHEN RECR-MOVE-IND = 'W'                                  00178400
178500          MOVE 'X' TO RECR-MOVE-IND                               00178500
178600        WHEN RECR-MOVE-IND = 'X'                                  00178600
178700          MOVE 'Y' TO RECR-MOVE-IND                               00178700
178800        WHEN RECR-MOVE-IND = 'Y'                                  00178800
178900          MOVE 'Z' TO RECR-MOVE-IND                               00178900
179000        WHEN RECR-MOVE-IND = 'Z'                                  00179000
179100          MOVE 'V' TO RECR-MOVE-IND                               00179100
179200       END-EVALUATE                                               00179200
179300     ELSE                                                         00179300
179400       MOVE  DETERMINE-FILE TO RECR-MOVE-IND                      00179400
179500     END-IF.                                                      00179500
179600                                                                  00179600
179700 B334-DETERMINE-RECR-MOVE-X.                                      00179700
179800     EXIT.                                                        00179800
179900                                                                  00179900
180000 B335-WRITE-UFILELIS.                                             00180000
180001                                                                          
180010     IF EXTR-VZ450-DSNAME (19:8) = 'VZ450MRG'                             
180020        MOVE 'Y' TO VAMS-VIPS-IND                                         
180030        INITIALIZE XVAMS-DSNAME                                           
180040        MOVE 'VGW' TO XVAMS-DSNAME (1:3)                                  
180050        MOVE EXTR-VZ450-DSNAME (4:15) TO XVAMS-DSNAME (4:15)              
180060        MOVE 'VAMS' TO XVAMS-DSNAME (19:4)                                
180070        MOVE EXTR-VZ450-DSNAME (27:7) TO XVAMS-DSNAME (23:7)              
180080        INITIALIZE XVIPS-DSNAME                                           
180090        MOVE 'VGW' TO XVIPS-DSNAME (1:3)                                  
180091        MOVE EXTR-VZ450-DSNAME (4:15) TO XVIPS-DSNAME (4:15)              
180092        MOVE 'VIPS' TO XVIPS-DSNAME (19:4)                                
180093        MOVE EXTR-VZ450-DSNAME (27:7) TO XVIPS-DSNAME (23:7)              
180094     ELSE                                                                 
180095        MOVE 'N' TO VAMS-VIPS-IND                                         
180096     END-IF                                                               
180097                                                                          
180100     EVALUATE TRUE                                                00180100
180200        WHEN RECR-MOVE-IND = 'A'                                  00180200
180300              MOVE SPACES TO EXTR-BAN                             00180300
180310              MOVE SPACES TO EXTR-BILL-DATE                       00095000
180400              PERFORM B500-OPEN-BAN-CURSOR                        00180400
180500              PERFORM B501-FETCH-BAN-CURSOR                       00180500
180600              IF END-OF-BAN-CSR                                   00180600
180700                 PERFORM B122A-WRITE-FILEA                        00180700
180800              ELSE                                                00180800
180900                 MOVE 'N' TO MAN-BAN-WRITTEN                      00180900
181000                 PERFORM UNTIL END-OF-BAN-CSR                     00181000
181100                    IF WK-OSID = 'M3'                             00181100
181200                       IF EXTR-MAN = WK-BAN                       00181200
181300                          MOVE 'Y' TO MAN-BAN-WRITTEN             00181300
181400                       ELSE                                       00181400
181500                          IF MAN-BAN-WRITTEN = 'N'                00181500
181600                             MOVE EXTR-MAN TO EXTR-BAN            00181600
181700                             MOVE EXTR-MAN-BILL-DATE              00181700
181800                               TO EXTR-BILL-DATE                  00181800
181900                             PERFORM B122A-WRITE-FILEA            00181900
182100                             MOVE 'Y' TO MAN-BAN-WRITTEN          00182100
182200                          END-IF                                  00182200
182300                       END-IF                                     00182300
182400                       MOVE EXTR-MAN TO SAV-MAN                   00182400
182500                       MOVE WK-BAN TO EXTR-BAN                    00182500
182600                       MOVE WK-BAN TO EXTR-MAN                    00182600
182700                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00182700
182800                       PERFORM B122A-WRITE-FILEA                  00182800
183000                       MOVE SAV-MAN TO EXTR-MAN                   00183000
183100                    ELSE                                          00183100
183200                       MOVE WK-BAN TO EXTR-BAN                    00183200
183300                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00183300
183400                       PERFORM B122A-WRITE-FILEA                  00183400
183600                    END-IF                                        00183600
183700                    PERFORM B501-FETCH-BAN-CURSOR                 00183700
183800                 END-PERFORM                                      00183800
183900              END-IF                                              00183900
184000              PERFORM B502-CLOSE-BAN-CURSOR                       00184000
184100        WHEN RECR-MOVE-IND = 'B'                                  00184100
184200              MOVE SPACES TO EXTR-BAN                             00184200
184201              MOVE SPACES TO EXTR-BILL-DATE                       00095000
184210              PERFORM B500-OPEN-BAN-CURSOR                        00184210
184220              PERFORM B501-FETCH-BAN-CURSOR                       00184220
184230              IF END-OF-BAN-CSR                                   00184230
184240                 PERFORM B122B-WRITE-FILEB                        00184240
184250              ELSE                                                00184250
184260                 MOVE 'N' TO MAN-BAN-WRITTEN                      00184260
184270                 PERFORM UNTIL END-OF-BAN-CSR                     00184270
184280                    IF WK-OSID = 'M3'                             00184280
184290                       IF EXTR-MAN = WK-BAN                       00184290
184291                          MOVE 'Y' TO MAN-BAN-WRITTEN             00184291
184292                       ELSE                                       00184292
184293                          IF MAN-BAN-WRITTEN = 'N'                00184293
184294                             MOVE EXTR-MAN TO EXTR-BAN            00184294
184295                             MOVE EXTR-MAN-BILL-DATE              00184295
184296                               TO EXTR-BILL-DATE                  00184296
184297                             PERFORM B122B-WRITE-FILEB            00184297
184299                             MOVE 'Y' TO MAN-BAN-WRITTEN          00184299
184300                          END-IF                                  00184300
184310                       END-IF                                     00184310
184320                       MOVE EXTR-MAN TO SAV-MAN                   00184320
184330                       MOVE WK-BAN TO EXTR-BAN                    00184330
184340                       MOVE WK-BAN TO EXTR-MAN                    00184340
184350                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00184350
184360                       PERFORM B122B-WRITE-FILEB                  00184360
184380                       MOVE SAV-MAN TO EXTR-MAN                   00184380
184390                    ELSE                                          00184390
184391                       MOVE WK-BAN TO EXTR-BAN                    00184391
184393                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00184392
184394                       PERFORM B122B-WRITE-FILEB                  00184393
184396                    END-IF                                        00184395
184397                    PERFORM B501-FETCH-BAN-CURSOR                 00184396
184398                 END-PERFORM                                      00184397
184399              END-IF                                              00184398
184400              PERFORM B502-CLOSE-BAN-CURSOR                       00184399
184401        WHEN RECR-MOVE-IND = 'C'                                  00184400
184410              MOVE SPACES TO EXTR-BAN                             00184410
184411              MOVE SPACES TO EXTR-BILL-DATE                       00095000
184420              PERFORM B500-OPEN-BAN-CURSOR                        00184420
184430              PERFORM B501-FETCH-BAN-CURSOR                       00184430
184440              IF END-OF-BAN-CSR                                   00184440
184450                 PERFORM B122C-WRITE-FILEC                        00184450
184460              ELSE                                                00184460
184470                 MOVE 'N' TO MAN-BAN-WRITTEN                      00184470
184480                 PERFORM UNTIL END-OF-BAN-CSR                     00184480
184490                    IF WK-OSID = 'M3'                             00184490
184491                       IF EXTR-MAN = WK-BAN                       00184491
184492                          MOVE 'Y' TO MAN-BAN-WRITTEN             00184492
184493                       ELSE                                       00184493
184494                          IF MAN-BAN-WRITTEN = 'N'                00184494
184495                             MOVE EXTR-MAN TO EXTR-BAN            00184495
184496                             MOVE EXTR-MAN-BILL-DATE              00184496
184497                               TO EXTR-BILL-DATE                  00184497
184498                             PERFORM B122C-WRITE-FILEC            00184498
184500                             MOVE 'Y' TO MAN-BAN-WRITTEN          00184500
184510                          END-IF                                  00184510
184520                       END-IF                                     00184520
184530                       MOVE EXTR-MAN TO SAV-MAN                   00184530
184540                       MOVE WK-BAN TO EXTR-BAN                    00184540
184550                       MOVE WK-BAN TO EXTR-MAN                    00184550
184560                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00184560
184570                       PERFORM B122C-WRITE-FILEC                  00184570
184590                       MOVE SAV-MAN TO EXTR-MAN                   00184590
184591                    ELSE                                          00184591
184592                       MOVE WK-BAN TO EXTR-BAN                    00184592
184593                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00184593
184594                       PERFORM B122C-WRITE-FILEC                  00184594
184596                    END-IF                                        00184596
184597                    PERFORM B501-FETCH-BAN-CURSOR                 00184597
184598                 END-PERFORM                                      00184598
184599              END-IF                                              00184599
184600              PERFORM B502-CLOSE-BAN-CURSOR                       00184600
184610        WHEN RECR-MOVE-IND = 'D'                                  00184610
184620              MOVE SPACES TO EXTR-BAN                             00184620
184621              MOVE SPACES TO EXTR-BILL-DATE                       00095000
184630              PERFORM B500-OPEN-BAN-CURSOR                        00184630
184640              PERFORM B501-FETCH-BAN-CURSOR                       00184640
184650              IF END-OF-BAN-CSR                                   00184650
184660                 PERFORM B122D-WRITE-FILED                        00184660
184670              ELSE                                                00184670
184680                 MOVE 'N' TO MAN-BAN-WRITTEN                      00184680
184690                 PERFORM UNTIL END-OF-BAN-CSR                     00184690
184691                    IF WK-OSID = 'M3'                             00184691
184692                       IF EXTR-MAN = WK-BAN                       00184692
184693                          MOVE 'Y' TO MAN-BAN-WRITTEN             00184693
184694                       ELSE                                       00184694
184695                          IF MAN-BAN-WRITTEN = 'N'                00184695
184696                             MOVE EXTR-MAN TO EXTR-BAN            00184696
184697                             MOVE EXTR-MAN-BILL-DATE              00184697
184698                               TO EXTR-BILL-DATE                  00184698
184699                             PERFORM B122D-WRITE-FILED            00184699
184710                             MOVE 'Y' TO MAN-BAN-WRITTEN          00184710
184720                          END-IF                                  00184720
184730                       END-IF                                     00184730
184740                       MOVE EXTR-MAN TO SAV-MAN                   00184740
184750                       MOVE WK-BAN TO EXTR-BAN                    00184750
184760                       MOVE WK-BAN TO EXTR-MAN                    00184760
184770                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00184770
184780                       PERFORM B122D-WRITE-FILED                  00184780
184791                       MOVE SAV-MAN TO EXTR-MAN                   00184791
184792                    ELSE                                          00184792
184793                       MOVE WK-BAN TO EXTR-BAN                    00184793
184794                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00184794
184795                       PERFORM B122D-WRITE-FILED                  00184795
184797                    END-IF                                        00184797
184798                    PERFORM B501-FETCH-BAN-CURSOR                 00184798
184799                 END-PERFORM                                      00184799
184800              END-IF                                              00184800
184801              PERFORM B502-CLOSE-BAN-CURSOR                       00184801
184810        WHEN RECR-MOVE-IND = 'E'                                  00184810
184820              MOVE SPACES TO EXTR-BAN                             00184820
184821              MOVE SPACES TO EXTR-BILL-DATE                       00095000
184830              PERFORM B500-OPEN-BAN-CURSOR                        00184830
184840              PERFORM B501-FETCH-BAN-CURSOR                       00184840
184850              IF END-OF-BAN-CSR                                   00184850
184860                 PERFORM B122E-WRITE-FILEE                        00184860
184870              ELSE                                                00184870
184880                 MOVE 'N' TO MAN-BAN-WRITTEN                      00184880
184890                 PERFORM UNTIL END-OF-BAN-CSR                     00184890
184891                    IF WK-OSID = 'M3'                             00184891
184892                       IF EXTR-MAN = WK-BAN                       00184892
184893                          MOVE 'Y' TO MAN-BAN-WRITTEN             00184893
184894                       ELSE                                       00184894
184895                          IF MAN-BAN-WRITTEN = 'N'                00184895
184896                             MOVE EXTR-MAN TO EXTR-BAN            00184896
184897                             MOVE EXTR-MAN-BILL-DATE              00184897
184898                               TO EXTR-BILL-DATE                  00184898
184899                             PERFORM B122E-WRITE-FILEE            00184899
184901                             MOVE 'Y' TO MAN-BAN-WRITTEN          00184901
184902                          END-IF                                  00184902
184903                       END-IF                                     00184903
184904                       MOVE EXTR-MAN TO SAV-MAN                   00184904
184905                       MOVE WK-BAN TO EXTR-BAN                    00184905
184906                       MOVE WK-BAN TO EXTR-MAN                    00184906
184907                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00184907
184908                       PERFORM B122E-WRITE-FILEE                  00184908
184910                       MOVE SAV-MAN TO EXTR-MAN                   00184910
184911                    ELSE                                          00184911
184912                       MOVE WK-BAN TO EXTR-BAN                    00184912
184913                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00184913
184914                       PERFORM B122E-WRITE-FILEE                  00184914
184916                    END-IF                                        00184916
184917                    PERFORM B501-FETCH-BAN-CURSOR                 00184917
184918                 END-PERFORM                                      00184918
184919              END-IF                                              00184919
184920              PERFORM B502-CLOSE-BAN-CURSOR                       00184920
184930        WHEN RECR-MOVE-IND = 'V'                                  00184930
185000              MOVE SPACES TO EXTR-BAN                             00185000
185010              MOVE SPACES TO EXTR-BILL-DATE                       00095000
185100              PERFORM B500-OPEN-BAN-CURSOR                        00185100
185200              PERFORM B501-FETCH-BAN-CURSOR                       00185200
185300              IF END-OF-BAN-CSR                                   00185300
185400                 PERFORM B122V-WRITE-FILEV                        00185400
185500              ELSE                                                00185500
185600                 MOVE 'N' TO MAN-BAN-WRITTEN                      00185600
185700                 PERFORM UNTIL END-OF-BAN-CSR                     00185700
185800                    IF WK-OSID = 'M3'                             00185800
185900                       IF EXTR-MAN = WK-BAN                       00185900
186000                          MOVE 'Y' TO MAN-BAN-WRITTEN             00186000
186100                       ELSE                                       00186100
186200                          IF MAN-BAN-WRITTEN = 'N'                00186200
186300                             MOVE EXTR-MAN TO EXTR-BAN            00186300
186400                             MOVE EXTR-MAN-BILL-DATE              00186400
186500                               TO EXTR-BILL-DATE                  00186500
186600                             PERFORM B122V-WRITE-FILEV            00186600
186800                             MOVE 'Y' TO MAN-BAN-WRITTEN          00186800
186900                          END-IF                                  00186900
187000                       END-IF                                     00187000
187100                       MOVE EXTR-MAN TO SAV-MAN                   00187100
187200                       MOVE WK-BAN TO EXTR-BAN                    00187200
187300                       MOVE WK-BAN TO EXTR-MAN                    00187300
187400                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00187400
187500                       PERFORM B122V-WRITE-FILEV                  00187500
187700                       MOVE SAV-MAN TO EXTR-MAN                   00187700
187800                     ELSE                                         00187800
187900                        MOVE WK-BAN TO EXTR-BAN                   00187900
188000                        MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE 00188000
188100                        PERFORM B122V-WRITE-FILEV                 00188100
188300                     END-IF                                       00188300
188400                     PERFORM B501-FETCH-BAN-CURSOR                00188400
188500                 END-PERFORM                                      00188500
188600              END-IF                                              00188600
188700              PERFORM B502-CLOSE-BAN-CURSOR                       00188700
188800        WHEN RECR-MOVE-IND = 'W'                                  00188800
188900              MOVE SPACES TO EXTR-BAN                             00188900
188901              MOVE SPACES TO EXTR-BILL-DATE                       00095000
188910              PERFORM B500-OPEN-BAN-CURSOR                        00188910
188920              PERFORM B501-FETCH-BAN-CURSOR                       00188920
188930              IF END-OF-BAN-CSR                                   00188930
188940                 PERFORM B122W-WRITE-FILEW                        00188940
188950              ELSE                                                00188950
188960                 MOVE 'N' TO MAN-BAN-WRITTEN                      00188960
188970                 PERFORM UNTIL END-OF-BAN-CSR                     00188970
188980                    IF WK-OSID = 'M3'                             00188980
188990                       IF EXTR-MAN = WK-BAN                       00188990
188991                          MOVE 'Y' TO MAN-BAN-WRITTEN             00188991
188992                       ELSE                                       00188992
188993                          IF MAN-BAN-WRITTEN = 'N'                00188993
188994                             MOVE EXTR-MAN TO EXTR-BAN            00188994
188995                             MOVE EXTR-MAN-BILL-DATE              00188995
188996                               TO EXTR-BILL-DATE                  00188996
188997                             PERFORM B122W-WRITE-FILEW            00188997
188999                             MOVE 'Y' TO MAN-BAN-WRITTEN          00188999
189000                          END-IF                                  00189000
189010                       END-IF                                     00189010
189020                       MOVE EXTR-MAN TO SAV-MAN                   00189020
189030                       MOVE WK-BAN TO EXTR-BAN                    00189030
189040                       MOVE WK-BAN TO EXTR-MAN                    00189040
189050                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00189050
189060                       PERFORM B122W-WRITE-FILEW                  00189060
189080                       MOVE SAV-MAN TO EXTR-MAN                   00189080
189090                    ELSE                                          00189090
189091                       MOVE WK-BAN TO EXTR-BAN                    00189091
189092                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00189092
189093                       PERFORM B122W-WRITE-FILEW                  00189093
189095                    END-IF                                        00189095
189096                    PERFORM B501-FETCH-BAN-CURSOR                 00189096
189097                 END-PERFORM                                      00189097
189098              END-IF                                              00189098
189099              PERFORM B502-CLOSE-BAN-CURSOR                       00189099
189100        WHEN RECR-MOVE-IND = 'X'                                  00189100
189110              MOVE SPACES TO EXTR-BAN                             00189110
189111              MOVE SPACES TO EXTR-BILL-DATE                       00095000
189120              PERFORM B500-OPEN-BAN-CURSOR                        00189120
189130              PERFORM B501-FETCH-BAN-CURSOR                       00189130
189140              IF END-OF-BAN-CSR                                   00189140
189150                 PERFORM B122X-WRITE-FILEX                        00189150
189160              ELSE                                                00189160
189170                 MOVE 'N' TO MAN-BAN-WRITTEN                      00189170
189180                 PERFORM UNTIL END-OF-BAN-CSR                     00189180
189190                    IF WK-OSID = 'M3'                             00189190
189191                       IF EXTR-MAN = WK-BAN                       00189191
189192                          MOVE 'Y' TO MAN-BAN-WRITTEN             00189192
189193                       ELSE                                       00189193
189194                          IF MAN-BAN-WRITTEN = 'N'                00189194
189195                             MOVE EXTR-MAN TO EXTR-BAN            00189195
189196                             MOVE EXTR-MAN-BILL-DATE              00189196
189197                               TO EXTR-BILL-DATE                  00189197
189198                             PERFORM B122X-WRITE-FILEX            00189198
189200                             MOVE 'Y' TO MAN-BAN-WRITTEN          00189200
189210                          END-IF                                  00189210
189220                       END-IF                                     00189220
189230                       MOVE EXTR-MAN TO SAV-MAN                   00189230
189240                       MOVE WK-BAN TO EXTR-BAN                    00189240
189250                       MOVE WK-BAN TO EXTR-MAN                    00189250
189260                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00189260
189270                       PERFORM B122X-WRITE-FILEX                  00189270
189290                       MOVE SAV-MAN TO EXTR-MAN                   00189290
189291                    ELSE                                          00189291
189292                       MOVE WK-BAN TO EXTR-BAN                    00189292
189293                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00189293
189294                       PERFORM B122X-WRITE-FILEX                  00189294
189296                    END-IF                                        00189296
189297                    PERFORM B501-FETCH-BAN-CURSOR                 00189297
189298                 END-PERFORM                                      00189298
189299              END-IF                                              00189299
189300              PERFORM B502-CLOSE-BAN-CURSOR                       00189300
189310        WHEN RECR-MOVE-IND = 'Y'                                  00189310
189320              MOVE SPACES TO EXTR-BAN                             00189320
189321              MOVE SPACES TO EXTR-BILL-DATE                       00095000
189330              PERFORM B500-OPEN-BAN-CURSOR                        00189330
189340              PERFORM B501-FETCH-BAN-CURSOR                       00189340
189350              IF END-OF-BAN-CSR                                   00189350
189360                 PERFORM B122Y-WRITE-FILEY                        00189360
189370              ELSE                                                00189370
189380                 MOVE 'N' TO MAN-BAN-WRITTEN                      00189380
189390                 PERFORM UNTIL END-OF-BAN-CSR                     00189390
189391                    IF WK-OSID = 'M3'                             00189391
189392                       IF EXTR-MAN = WK-BAN                       00189392
189393                          MOVE 'Y' TO MAN-BAN-WRITTEN             00189393
189394                       ELSE                                       00189394
189395                          IF MAN-BAN-WRITTEN = 'N'                00189395
189396                             MOVE EXTR-MAN TO EXTR-BAN            00189396
189397                             MOVE EXTR-MAN-BILL-DATE              00189397
189398                               TO EXTR-BILL-DATE                  00189398
189399                             PERFORM B122Y-WRITE-FILEY            00189399
189410                             MOVE 'Y' TO MAN-BAN-WRITTEN          00189410
189420                          END-IF                                  00189420
189430                       END-IF                                     00189430
189440                       MOVE EXTR-MAN TO SAV-MAN                   00189440
189450                       MOVE WK-BAN TO EXTR-BAN                    00189450
189460                       MOVE WK-BAN TO EXTR-MAN                    00189460
189470                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00189470
189480                       PERFORM B122Y-WRITE-FILEY                  00189480
189491                       MOVE SAV-MAN TO EXTR-MAN                   00189491
189492                    ELSE                                          00189492
189493                       MOVE WK-BAN TO EXTR-BAN                    00189493
189494                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00189494
189495                       PERFORM B122Y-WRITE-FILEY                  00189495
189497                    END-IF                                        00189497
189498                    PERFORM B501-FETCH-BAN-CURSOR                 00189498
189499                 END-PERFORM                                      00189499
189500              END-IF                                              00189500
189501              PERFORM B502-CLOSE-BAN-CURSOR                       00189501
189510        WHEN RECR-MOVE-IND = 'Z'                                  00189510
189520              MOVE SPACES TO EXTR-BAN                             00189520
189521              MOVE SPACES TO EXTR-BILL-DATE                       00095000
189530              PERFORM B500-OPEN-BAN-CURSOR                        00189530
189540              PERFORM B501-FETCH-BAN-CURSOR                       00189540
189550              IF END-OF-BAN-CSR                                   00189550
189560                 PERFORM B122Z-WRITE-FILEZ                        00189560
189570              ELSE                                                00189570
189580                 MOVE 'N' TO MAN-BAN-WRITTEN                      00189580
189590                 PERFORM UNTIL END-OF-BAN-CSR                     00189590
189591                    IF WK-OSID = 'M3'                             00189591
189592                       IF EXTR-MAN = WK-BAN                       00189592
189593                          MOVE 'Y' TO MAN-BAN-WRITTEN             00189593
189594                       ELSE                                       00189594
189595                          IF MAN-BAN-WRITTEN = 'N'                00189595
189596                             MOVE EXTR-MAN TO EXTR-BAN            00189596
189597                             MOVE EXTR-MAN-BILL-DATE              00189597
189598                               TO EXTR-BILL-DATE                  00189598
189599                             PERFORM B122Z-WRITE-FILEZ            00189599
189601                             MOVE 'Y' TO MAN-BAN-WRITTEN          00189601
189602                          END-IF                                  00189602
189603                       END-IF                                     00189603
189604                       MOVE EXTR-MAN TO SAV-MAN                   00189604
189605                       MOVE WK-BAN TO EXTR-BAN                    00189605
189606                       MOVE WK-BAN TO EXTR-MAN                    00189606
189607                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00189607
189608                       PERFORM B122Z-WRITE-FILEZ                  00189608
189610                       MOVE SAV-MAN TO EXTR-MAN                   00189610
189611                    ELSE                                          00189611
189612                       MOVE WK-BAN TO EXTR-BAN                    00189612
189613                       MOVE EXTR-MAN-BILL-DATE TO EXTR-BILL-DATE  00189613
189614                       PERFORM B122Z-WRITE-FILEZ                  00189614
189616                    END-IF                                        00189616
189617                    PERFORM B501-FETCH-BAN-CURSOR                 00189617
189618                 END-PERFORM                                      00189618
189619              END-IF                                              00189619
189620              PERFORM B502-CLOSE-BAN-CURSOR                       00189620
189630        END-EVALUATE.                                             00189630
189700                                                                  00189700
189800 B335-WRITE-UFILELIS-X.                                           00189800
189900     EXIT.                                                        00189900
190000                                                                  00190000
190100 B400-APPEND-MANUAL-LIST.                                         00190100
190200     PERFORM B410-ALLOC-STRIPIN                                   00190200
190300        THRU B410-ALLOC-STRIPIN-X                                 00190300
190400                                                                  00190400
190500     IF ALLOFILE-ERROR-CODE = 0                                   00190500
190600       MOVE 'OPENFLIN' TO STRIPIO-ENTRY                           00190600
190700       MOVE '0' TO STRIPIO-EOF-SW                                 00190700
190800       PERFORM Z000-CALL-STRIPIO-PGM                              00190800
190900          THRU Z000-CALL-STRIPIO-PGM-X                            00190900
191000                                                                  00191000
191100       PERFORM UNTIL STRIPIO-EOF-SW = '1'                         00191100
191200               MOVE SPACES TO STRIPIO-RECORD                      00191200
191300               MOVE 'READIN' TO STRIPIO-ENTRY                     00191300
191400               PERFORM Z000-CALL-STRIPIO-PGM                      00191400
191500                  THRU Z000-CALL-STRIPIO-PGM-X                    00191500
191600               IF STRIPIO-EOF-SW = '0'                            00191600
191700                 WRITE  FD-FILELISTA-RECORD FROM                  00191700
191800                        STRIPIO-RECORD                            00191800
191900               END-IF                                             00191900
192000       END-PERFORM                                                00192000
192100                                                                  00192100
192200       MOVE 'CLOSFLIN' TO STRIPIO-ENTRY                           00192200
192300       PERFORM Z000-CALL-STRIPIO-PGM                              00192300
192400          THRU Z000-CALL-STRIPIO-PGM-X                            00192400
192500     END-IF                                                       00192500
192600     .                                                            00192600
192700 B400-APPEND-MANUAL-LIST-X.                                       00192700
192800      EXIT.                                                       00192800
192900                                                                  00192900
193000 B410-ALLOC-STRIPIN.                                              00193000
193100     STRING 'BMGNY0PN.BMGBM3C.FLLSTAPP.' WS-JUL-CYCL              00193100
193200       DELIMITED BY SIZE INTO WORK-DSNAME                         00193200
193300     MOVE  4                         TO ALLOFILE-NUM-PARMS        00193300
193400     MOVE 'DDNAME=STRIPIN'           TO ALLOFILE-PARM (1).        00193400
193500     MOVE 'DSNAME='                  TO ALLOFILE-PARM (2).        00193500
193600     MOVE WORK-DSNAME                TO ALLOFILE-PARM (2)(8:44).  00193600
193700     MOVE 'DISP=SHR'                 TO ALLOFILE-PARM (3).        00193700
193800     MOVE 'FREE=CLOSE'               TO ALLOFILE-PARM (4).        00193800
193900     CALL ALLOFILE-PGM USING ALLOFILE-PARMS                       00193900
194000     IF ALLOFILE-ERROR-CODE NOT = 0                               00194000
194100       MOVE 'DISP=SHR'               TO ALLOFILE-PARM (3)         00194100
194200       MOVE 'BMGVZ0CN'               TO ALLOFILE-PARM (2)(8:8)    00194200
194300       CALL ALLOFILE-PGM USING ALLOFILE-PARMS                     00194300
194400     END-IF.                                                      00194400
194500 B410-ALLOC-STRIPIN-X.                                            00194500
194600     EXIT.                                                        00194600
194700                                                                  00194700
194800 B500-OPEN-BAN-CURSOR.                                            00194800
194900                                                                  00194900
195000     MOVE EXTR-MAN TO WK-MAN.                                     00195000
195100     MOVE EXTR-CUST-LABEL(1:5) TO WK-CONFIG(1:5)                  00195100
195200     MOVE '-'                  TO WK-CONFIG(6:1)                  00195200
195300     MOVE EXTR-CUST-LABEL(6:2) TO WK-CONFIG(7:2)                  00195300
195400     EXEC SQL                                                     00195400
195500          OPEN BAN_CUR                                            00195500
195600     END-EXEC.                                                    00195600
195700                                                                  00195700
195800     EVALUATE SQLCODE                                             00195800
195900     WHEN +000                                                    00195900
196000       CONTINUE                                                   00196000
196100     WHEN OTHER                                                   00196100
196200        DISPLAY '!!! ERROR OPEN BAN_CUR !!!'                      00196200
196300        PERFORM U000-DISPLAY-DB2-ERROR-MSG                        00196300
196400           THRU U000-DISPLAY-DB2-ERROR-MSG-X                      00196400
196500     END-EVALUATE.                                                00196500
196600                                                                  00196600
196700 B500-OPEN-BAN-CURSOR-X.                                          00196700
196800     EXIT.                                                        00196800
196900                                                                  00196900
197000 B501-FETCH-BAN-CURSOR.                                           00197000
197100                                                                  00197100
197200     MOVE SPACES TO WK-BAN.                                       00197200
197300                                                                  00197300
197400     EXEC SQL                                                     00197400
197500        FETCH BAN_CUR                                             00197500
197600         INTO :WK-BAN                                             00197600
197700             ,:WK-OSID                                            00197700
197800     END-EXEC.                                                    00197800
197900                                                                  00197900
198000     EVALUATE SQLCODE                                             00198000
198100         WHEN 000                                                 00198100
198200           SET NOT-END-OF-BAN-CSR TO TRUE                         00198200
198300         WHEN 100                                                 00198300
198400           SET END-OF-BAN-CSR     TO TRUE                         00198400
198500         WHEN OTHER                                               00198500
198600              DISPLAY 'SQLCODE : ' SQLCODE                        00198600
198700              DISPLAY 'ERROR WHILE FETCH THE BAN_CUR'             00198700
198800              PERFORM U000-DISPLAY-DB2-ERROR-MSG                  00198800
198900                 THRU U000-DISPLAY-DB2-ERROR-MSG-X                00198900
199000     END-EVALUATE.                                                00199000
199100                                                                  00199100
199200 B501-FETCH-BAN-CURSOR-X.                                         00199200
199300     EXIT.                                                        00199300
199400                                                                  00199400
199500 B502-CLOSE-BAN-CURSOR.                                           00199500
199600                                                                  00199600
199700     EXEC SQL                                                     00199700
199800          CLOSE BAN_CUR                                           00199800
199900     END-EXEC.                                                    00199900
200000                                                                  00200000
200100     EVALUATE SQLCODE                                             00200100
200200     WHEN +000                                                    00200200
200300       CONTINUE                                                   00200300
200400     WHEN OTHER                                                   00200400
200500        DISPLAY '!!! ERROR CLOSE BAN_CUR !!!'                     00200500
200600        PERFORM U000-DISPLAY-DB2-ERROR-MSG                        00200600
200700           THRU U000-DISPLAY-DB2-ERROR-MSG-X                      00200700
200800     END-EVALUATE.                                                00200800
200900                                                                  00200900
201000 B502-CLOSE-BAN-CURSOR-X.                                         00201000
201100     EXIT.                                                        00201100
201200                                                                  00201200
201300                                                                  00201300
201400 U000-DISPLAY-DB2-ERROR-MSG.                                      00201400
201500     MOVE      SQLCODE         TO  DISPLAY-SQLCODE.               00201500
201600     MOVE      SQLSTATE        TO  DISPLAY-SQLSTATE.              00201600
201700     DISPLAY 'SQLCODE=' DISPLAY-SQLCODE ',SQLSTATE='              00201700
201800                        DISPLAY-SQLSTATE                          00201800
201900                                                                  00201900
202000     CALL DSNTIAR-PGM USING SQLCA                                 00202000
202100                            ERROR-MESSAGE                         00202100
202200                            ERROR-TEXT-LEN                        00202200
202300     PERFORM VARYING ERROR-INDEX FROM 1 BY 1                      00202300
202400       UNTIL ERROR-INDEX > 8                                      00202400
202500             DISPLAY ERROR-TEXT (ERROR-INDEX)                     00202500
202600     END-PERFORM.                                                 00202600
202700 U000-DISPLAY-DB2-ERROR-MSG-X.                                    00202700
202800     EXIT.                                                        00202800
202900                                                                  00202900
203000 Z000-CALL-STRIPIO-PGM.                                           00203000
203100     CALL STRIPIO-PGM USING STRIPIO-ENTRY                         00203100
203200                            STRIPIO-RECORD                        00203200
203300                            STRIPIO-EOF-SW.                       00203300
203400 Z000-CALL-STRIPIO-PGM-X.                                         00203400
203500     EXIT.                                                        00203500
203600                                                                  00203600
203700 Z020-CALL-FILE03-PGM.                                            00203700
203800     CALL FILE03-PGM USING FILE03-ENTRY                           00203800
203900                           FILE03-RECORD                          00203900
204000                           FILE03-EOF-SW                          00204000
204100                           FILE03-JFCB.                           00204100
204200                                                                  00204200
204300 Z020-CALL-FILE03-PGM-X.                                          00204300
204400     EXIT.                                                        00204400
204500                                                                  00204500
204600 EJECT                                                            00204600
204700                                                                  00204700
204800 C000-FINISH-PGM.                                                 00204800
204900      CLOSE FILE-LISTA.                                           00204900
205000      CLOSE FILE-LISTB.                                           00205000
205100      CLOSE FILE-LISTC.                                           00205100
205200      CLOSE FILE-LISTD.                                           00205200
205300      CLOSE FILE-LISTE.                                           00205300
205400      CLOSE FILE-LISTV.                                           00205400
205500      CLOSE FILE-LISTW.                                           00205500
205600      CLOSE FILE-LISTX.                                           00205600
205700      CLOSE FILE-LISTY.                                           00205700
205800      CLOSE FILE-LISTZ.                                           00205800
205900      MOVE 'DESTROY' TO THREADIO-ENTRY.                           00205900
206000      CALL THREADIO-PGM USING THREADIO-PARMS.                     00206000
206100      DISPLAY '-------- STATISTICS---------------'                00206100
206200      DISPLAY 'NO OF ROWS WRITTEN  IN FILELIST ====='             00206200
206300            WS-R-COUNT.                                           00206300
206400                                                                  00206400
206500 C000-FINISH-PGM-X.                                               00206500
206600     EXIT.                                                        00206600
